{
  "arXiv": "http://arxiv.org/abs/2101.07396",
  "title": "ArtEmis: Affective Language for Visual Art",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Achlioptas_ArtEmis_Affective_Language_for_Visual_Art_CVPR_2021_paper.pdf",
  "authors": [
    "Panos Achlioptas",
    "Maks Ovsjanikov",
    "Kilichbek Haydarov",
    "Mohamed Elhoseiny",
    "Leonidas J. Guibas"
  ],
  "abstract": "We present a novel large-scale dataset and accompanying machine learning models aimed at providing a detailed understanding of the interplay between visual content, its emotional effect, and explanations for the latter in language. In contrast to most existing annotation datasets in computer vision, we focus on the affective experience triggered by visual artworks and ask the annotators to indicate the dominant emotion they feel for a given image and, crucially, to also provide a grounded verbal explanation for their emotion choice. As we demonstrate below, this leads to a rich set of signals for both the objective content and the affective impact of an image, creating associations with abstract concepts (e.g., \"freedom\" or \"love\"), or references that go beyond what is directly visible, including visual similes and metaphors, or subjective references to personal experiences. We focus on visual art (e.g., paintings, artistic photographs) as it is a prime example of imagery created to elicit emotional responses from its viewers. Our dataset, termed ArtEmis, contains 455K emotion attributions and explanations from humans, on 80K artworks from WikiArt. Building on this data, we train and demonstrate a series of captioning systems capable of expressing and explaining emotions from visual stimuli. Remarkably, the captions produced by these systems often succeed in reflecting the semantic and abstract content of the image, going well beyond systems trained on existing datasets.",
  "s2id": "3c6a6adffc390f56942b0c8f9b1d246acc7dd1e1",
  "twitter": {
    "retweets": 110,
    "likes": 486,
    "replies": 8,
    "ids": [
      "1356073989584510976",
      "1351719926772477953",
      "1353631998238191616",
      "1351924516033765376",
      "1351842227694170114",
      "1376855379833946113",
      "1375149550315405312",
      "1362397712386297856",
      "1362397461789040642",
      "1356027110205382659",
      "1375107799332577282",
      "1353461682702610432",
      "1351721370300907521",
      "1351773829782233088",
      "1351917609260875776",
      "1376671079956164619",
      "1353508223492435971",
      "1375799346034311171",
      "1364826214561636357",
      "1375436421541064712",
      "1375756803187806208",
      "1376884549938864130"
    ]
  },
  "citations": 4,
  "posterSession": "Thursday"
}