{
  "arXiv": "http://arxiv.org/abs/2003.11596",
  "title": "Learning Multi-Scale Photo Exposure Correction",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Afifi_Learning_Multi-Scale_Photo_Exposure_Correction_CVPR_2021_paper.pdf",
  "authors": [
    "Mahmoud Afifi",
    "Konstantinos G. Derpanis",
    "Bjorn Ommer",
    "Michael S. Brown"
  ],
  "abstract": "Capturing photographs with wrong exposures remains a major source of errors in camera-based imaging. Exposure problems are categorized as either: (i) overexposed, where the camera exposure was too long, resulting in bright and washed-out image regions, or (ii) underexposed, where the exposure was too short, resulting in dark regions. Both under- and overexposure greatly reduce the contrast and visual appeal of an image. Prior work mainly focuses on underexposed images or general image enhancement. In contrast, our proposed method targets both over- and under-exposure errors in photographs. We formulate the exposure correction problem as two main sub-problems: (i) color enhancement and (ii) detail enhancement. Accordingly, we propose a coarse-to-fine deep neural network (DNN) model, trainable in an end-to-end manner, that addresses each sub-problem separately. A key aspect of our solution is a new dataset of over 24,000 images exhibiting the broadest range of exposure values to date with a corresponding properly exposed image. Our method achieves results on par with existing state-of-the-art methods on underexposed images and yields significant improvements for images suffering from overexposure errors.",
  "s2id": "5960dd670496a6dfc37dac1d0b14b55a17ac527a",
  "twitter": {
    "retweets": 22,
    "likes": 74,
    "replies": 3,
    "ids": [
      "1243357000693497856",
      "1243579787047841793",
      "1243558889066356736",
      "1243986274815369218",
      "1243640019929026561",
      "1331276671702487040",
      "1331321816531542018",
      "1243667202991153153",
      "1243367387115581440",
      "1243441215577751552",
      "1243518438347362306",
      "1243714559971659776",
      "1243796567859040260",
      "1243808825142099968",
      "1243895870938062848",
      "1244077095036346368",
      "1244273196968312834",
      "1331065177173762048",
      "1331080462991839232",
      "1243337122939052037"
    ]
  },
  "citations": 0,
  "posterSession": "Wednesday"
}