{
  "arXiv": "http://arxiv.org/abs/2101.04777",
  "title": "Binary TTC: A Temporal Geofence for Autonomous Navigation",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Badki_Binary_TTC_A_Temporal_Geofence_for_Autonomous_Navigation_CVPR_2021_paper.pdf",
  "authors": [
    "Abhishek Badki",
    "Orazio Gallo",
    "Jan Kautz",
    "Pradeep Sen"
  ],
  "abstract": "Time-to-contact (TTC), the time for an object to collide with the observer's plane, is a powerful tool for path planning: it is potentially more informative than the depth, velocity, and acceleration of objects in the scene---even for humans. TTC presents several advantages, including requiring only a monocular, uncalibrated camera. However, regressing TTC for each pixel is not straightforward, and most existing methods make over-simplifying assumptions about the scene. We address this challenge by estimating TTC via a series of simpler, binary classifications. We predict with low latency whether the observer will collide with an obstacle within a certain time, which is often more critical than knowing exact, per-pixel TTC. For such scenarios, our method offers a temporal geofence in 6.4 ms---over 25x faster than existing methods. Our approach can also estimate per-pixel TTC with arbitrarily fine quantization (including continuous values), when the computational budget allows for it. To the best of our knowledge, our method is the first to offer TTC information (binary or coarsely quantized) at sufficiently high frame-rates for practical use.",
  "s2id": "66476e14f784c98ce7cf2c053d17f739bc85e23b",
  "twitter": {
    "retweets": 11,
    "likes": 46,
    "replies": 2,
    "ids": [
      "1403747612990214150",
      "1349592088376188931",
      "1349820391011676161",
      "1367195695262748675",
      "1349799259260899329",
      "1350638171223187459",
      "1350637988737380352",
      "1350637919476871168",
      "1349728104428826624",
      "1349546867621834753"
    ]
  },
  "citations": 0,
  "posterSession": "Thursday"
}