{
  "arXiv": null,
  "title": "What's in the Image? Explorable Decoding of Compressed Images",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Bahat_Whats_in_the_Image_Explorable_Decoding_of_Compressed_Images_CVPR_2021_paper.pdf",
  "authors": [
    "Yuval Bahat",
    "Tomer Michaeli"
  ],
  "abstract": "The ever-growing amounts of visual contents captured on a daily basis necessitate the use of lossy compression methods in order to save storage space and transmission bandwidth. While extensive research efforts are devoted to improving compression techniques, every method inevitably discards information. Especially at low bit rates, this information often corresponds to semantically meaningful visual cues, so that decompression involves significant ambiguity. In spite of this fact, existing decompression algorithms typically produce only a single output, and do not allow the viewer to explore the set of images that map to the given compressed code. In this work we propose the first image decompression method to facilitate user-exploration of the diverse set of natural images that could have given rise to the compressed input code, thus granting users the ability to determine what could and what could not have been there in the original scene. Specifically, we develop a novel deep-network based decoder architecture for the ubiquitous JPEG standard, which allows traversing the set of decompressed images that are consistent with the compressed JPEG file. To allow for simple user interaction, we develop a graphical user interface comprising several intuitive exploration tools, including an automatic tool for examining specific solutions of interest. We exemplify our framework on graphical, medical and forensic use cases, demonstrating its wide range of potential applications.",
  "s2id": "",
  "twitter": {
    "retweets": 1,
    "likes": 2,
    "replies": 0,
    "ids": [
      "1376741265895657472",
      "1376952656921571330",
      "1376756203771023360",
      "1376726191252467716",
      "1376726189612630018"
    ]
  },
  "posterSession": "Tuesday"
}