{
  "arXiv": "http://arxiv.org/abs/2009.09405",
  "title": "Scale-Localized Abstract Reasoning",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Benny_Scale-Localized_Abstract_Reasoning_CVPR_2021_paper.pdf",
  "authors": [
    "Yaniv Benny",
    "Niv Pekar",
    "Lior Wolf"
  ],
  "abstract": "We consider the abstract relational reasoning task, which is commonly used as an intelligence test. Since some patterns have spatial rationales, while others are only semantic, we propose a multi-scale architecture that processes each query in multiple resolutions. We show that indeed different rules are solved by different resolutions and a combined multi-scale approach outperforms the existing state of the art in this task on all benchmarks by 5-54%. The success of our method is shown to arise from multiple novelties. First, it searches for relational patterns in multiple resolutions, which allows it to readily detect visual relations, such as location, in higher resolution, while allowing the lower resolution module to focus on semantic relations, such as shape type. Second, we optimize the reasoning network of each resolution proportionally to its performance, hereby we motivate each resolution to specialize on the rules for which it performs better than the others and ignore cases that are already solved by the other resolutions. Third, we propose a new way to pool information along the rows and the columns of the illustration-grid of the query. Our work also analyses the existing benchmarks, demonstrating that the RAVEN dataset selects the negative examples in a way that is easily exploited. We, therefore, propose a modified version of the RAVEN dataset, named RAVEN-FAIR. Our code and pretrained models are available at https://github.com/yanivbenny/MRNet.",
  "s2id": "e34733fa877a2aa8a9a5eb1effd4f98f82e1d1de",
  "twitter": {
    "retweets": 0,
    "likes": 1,
    "replies": 0,
    "ids": [
      "1308275417602822144",
      "1308415918737887238",
      "1308280058121838592",
      "1308238312541310976",
      "1308219726074654720"
    ]
  },
  "citations": 1,
  "posterSession": "Thursday"
}