{
  "arXiv": "http://arxiv.org/abs/1910.00780",
  "title": "How Does Topology Influence Gradient Propagation and Model Performance of Deep Networks With DenseNet-Type Skip Connections?",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Bhardwaj_How_Does_Topology_Influence_Gradient_Propagation_and_Model_Performance_of_CVPR_2021_paper.pdf",
  "authors": [
    "Kartikeya Bhardwaj",
    "Guihong Li",
    "Radu Marculescu"
  ],
  "abstract": "DenseNets introduce concatenation-type skip connections that achieve state-of-the-art accuracy in several computer vision tasks. In this paper, we reveal that the topology of the concatenation-type skip connections is closely related to the gradient propagation which, in turn, enables a predictable behavior of DNNs' test performance. To this end, we introduce a new metric called NN-Mass to quantify how effectively information flows through DNNs. Moreover, we empirically show that NN-Mass also works for other types of skip connections, e.g., for ResNets, Wide-ResNets (WRNs), and MobileNets, which contain addition-type skip connections (i.e., residuals or inverted residuals). As such, for both DenseNet-like CNNs and ResNets/WRNs/MobileNets, our theoretically grounded NN-Mass can identify models with similar accuracy, despite having significantly different size/compute requirements. Detailed experiments on both synthetic and real datasets (e.g., MNIST, CIFAR-10, CIFAR-100, ImageNet) provide extensive evidence for our insights. Finally, the closed-form equation of our NN-Mass enables us to design significantly compressed DenseNets (for CIFAR-10) and MobileNets (for ImageNet) directly at initialization without time-consuming training and/or searching.",
  "s2id": "",
  "twitter": {
    "retweets": 2,
    "likes": 9,
    "replies": 3,
    "ids": [
      "1179559025224163330",
      "1304815722800046080",
      "1180322959510032384",
      "1179571882888241152",
      "1179578122406109184",
      "1179587803681820672",
      "1179596930084564993",
      "1179713218341736449",
      "1179726909577580544",
      "1179753223323820033",
      "1393787294620999681",
      "1377880773634764803",
      "1281584210927595520",
      "1281644654748856321",
      "1281765490520666112",
      "1281961566343254016",
      "1282142913384898562",
      "1282339096258633728",
      "1282399623571628032",
      "1281402908228177920"
    ]
  },
  "posterSession": "Thursday"
}