{
  "arXiv": "http://arxiv.org/abs/2012.03515",
  "title": "Fine-Grained Angular Contrastive Learning With Coarse Labels",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Bukchin_Fine-Grained_Angular_Contrastive_Learning_With_Coarse_Labels_CVPR_2021_paper.pdf",
  "authors": [
    "Guy Bukchin",
    "Eli Schwartz",
    "Kate Saenko",
    "Ori Shahar",
    "Rogerio Feris",
    "Raja Giryes",
    "Leonid Karlinsky"
  ],
  "abstract": "Few-shot learning methods offer pre-training techniques optimized for easier later adaptation of the model to new classes (unseen during training) using one or a few examples. This adaptivity to unseen classes is especially important for many practical applications where the pre-trained label space cannot remain fixed for effective use and the model needs to be \"specialized\" to support new categories on the fly. One particularly interesting scenario, essentially overlooked by the few-shot literature, is Coarse-to-Fine Few-Shot (C2FS), where the training classes (e.g. animals) are of much `coarser granularity' than the target (test) classes (e.g. breeds). A very practical example of C2FS is when the target classes are sub-classes of the training classes. Intuitively, it is especially challenging as (both regular and few-shot) supervised pre-training tends to learn to ignore intra-class variability which is essential for separating sub-classes. In this paper, we introduce a novel 'Angular normalization' module that allows to effectively combine supervised and self-supervised contrastive pre-training to approach the proposed C2FS task, demonstrating significant gains in a broad study over multiple baselines and datasets. We hope that this work will help to pave the way for future research on this new, challenging, and very practical topic of C2FS classification.",
  "s2id": "370ff19f0d5983ec61d490a17da47095ee4a29cd",
  "twitter": {
    "retweets": 0,
    "likes": 2,
    "replies": 0
  },
  "citations": 0,
  "posterSession": "Wednesday"
}