{
  "arXiv": "http://arxiv.org/abs/2006.10219",
  "title": "Sequential Graph Convolutional Network for Active Learning",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Caramalau_Sequential_Graph_Convolutional_Network_for_Active_Learning_CVPR_2021_paper.pdf",
  "authors": [
    "Razvan Caramalau",
    "Binod Bhattarai",
    "Tae-Kyun Kim"
  ],
  "abstract": "We propose a novel pool-based Active Learning frame-work constructed on a sequential Graph Convolution Net-work (GCN). Each image's feature from a pool of data rep-resents a node in the graph and the edges encode their similarities. With a small number of randomly sampled images as seed labelled examples, we learn the parameters of the graph to distinguish labelled vs unlabelled nodes by minimising the binary cross-entropy loss. GCN performs message-passing operations between the nodes, and hence, induces similar representations of the strongly associated nodes. We exploit these characteristics of GCN to select the unlabelled examples which are sufficiently different from la-belled ones. To this end, we utilise the graph node embed-dings and their confidence scores and adapt sampling techniques such as CoreSet and uncertainty-based methods to query the nodes. We flip the label of newly queried nodes from unlabelled to labelled, re-train the learner to optimise the downstream task and the graph to minimise its modified objective. We continue this process within a fixed budget. We evaluate our method on 6 different benchmarks: 4 real image classification, 1 depth-based hand pose estimation and 1 synthetic RGB image classification datasets. Our method outperforms several competitive baselines such as VAAL, Learning Loss, CoreSet and attains the new state-of-the-art performance on multiple applications.",
  "s2id": "9898b3d600b3881bde162b7e4b668a3c063cba10",
  "twitter": {
    "retweets": 10,
    "likes": 36,
    "replies": 3,
    "ids": [
      "1274009210775318530",
      "1366301786487877632",
      "1274736366958436352",
      "1274487263687315457",
      "1377994415202037764",
      "1290169214804754433",
      "1378749514840936450",
      "1274206307759751168",
      "1274155222726819840",
      "1273874275896889344",
      "1273973973278228480",
      "1274351585930498052",
      "1273874242518605826",
      "1273863484762206208",
      "1273819875358670849",
      "1273792699741753345",
      "1274250259141705728",
      "1274668465333374976",
      "1274366531355328513",
      "1378568260728324097",
      "1274849754682449927",
      "1308219786350989313",
      "1308242842335154177",
      "1308295349325373441",
      "1308415969656700929",
      "1366301937117839360",
      "1377798247587180544",
      "1378190666585489415",
      "1273791335552581632"
    ]
  },
  "citations": 1,
  "posterSession": "Wednesday"
}