{
  "arXiv": "http://arxiv.org/abs/2011.04305",
  "title": "Learning the Best Pooling Strategy for Visual Semantic Embedding",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Chen_Learning_the_Best_Pooling_Strategy_for_Visual_Semantic_Embedding_CVPR_2021_paper.pdf",
  "authors": [
    "Jiacheng Chen",
    "Hexiang Hu",
    "Hao Wu",
    "Yuning Jiang",
    "Changhu Wang"
  ],
  "abstract": "Visual Semantic Embedding (VSE) is a dominant approach for vision-language retrieval, which aims at learning a deep embedding space such that visual data are embedded close to their semantic text labels or descriptions. Recent VSE models use complex methods to better contextualize and aggregate multi-modal features into holistic embeddings. However, we discover that surprisingly simple (but carefully selected) global pooling functions (e.g., max pooling) outperform those complex models, across different feature extractors. Despite its simplicity and effectiveness, seeking the best pooling function for different data modality and feature extractor is costly and tedious, especially when the size of features varies (e.g., text, video). Therefore, we propose a Generalized Pooling Operator (GPO), which learns to automatically adapt itself to the best pooling strategy for different features, requiring no manual tuning while staying effective and efficient. We extend the VSE model using this proposed GPO and denote it as VSE. Without bells and whistles, VSE outperforms previous VSE methods significantly on image-text retrieval benchmarks across popular feature extractors. With a simple adaptation, variants of VSE further demonstrate its strength by achieving the new state of the art on two video-text retrieval datasets. Comprehensive experiments and visualizations confirm that GPO always discovers the best pooling strategy and can be a plug-and-play feature aggregation module for standard VSE models.",
  "s2id": "608006b0c6c223ef449cbafdc064afdb52bf4410",
  "twitter": {
    "retweets": 0,
    "likes": 7,
    "replies": 0
  },
  "citations": 3,
  "posterSession": "Friday"
}