{
  "arXiv": "http://arxiv.org/abs/2012.06908",
  "title": "The Lottery Tickets Hypothesis for Supervised and Self-Supervised Pre-Training in Computer Vision Models",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Chen_The_Lottery_Tickets_Hypothesis_for_Supervised_and_Self-Supervised_Pre-Training_in_CVPR_2021_paper.pdf",
  "authors": [
    "Tianlong Chen",
    "Jonathan Frankle",
    "Shiyu Chang",
    "Sijia Liu",
    "Yang Zhang",
    "Michael Carbin",
    "Zhangyang Wang"
  ],
  "abstract": "The computer vision world has been re-gaining enthusiasm in various pre-trained models, including both classical ImageNet supervised pre-training and recently emerged self-supervised pre-training such as simCLR and MoCo. Pre-trained weights often boost a wide range of downstream tasks including classification, detection, and segmentation. Latest studies suggest that pre-training benefits from gigantic model capacity. We are hereby curious and ask: after pre-training, does a pre-trained model indeed have to stay large for its downstream transferability? In this paper, we examine supervised and self-supervised pre-trained models through the lens of the lottery ticket hypothesis (LTH). LTH identifies highly sparse matching subnetworks that can be trained in isolation from (nearly) scratch yet still reach the full models' performance. We extend the scope of LTH and question whether matching subnetworks still exist in pre-trained computer vision models, that enjoy the same downstream transfer performance. Our extensive experiments convey an overall positive message: from all pre-trained weights obtained by ImageNet classification, simCLR, and MoCo, we are consistently able to locate such matching subnetworks at 59.04% to 96.48% sparsity that transfer universally to multiple downstream tasks, whose performance see no degradation compared to using full pre-trained weights. Further analyses reveal that subnetworks found from different pre-training tend to yield diverse mask structures and perturbation sensitivities. We conclude that the core LTH observations remain generally relevant in the pre-training paradigm of computer vision, but more delicate discussions are needed in some cases. Codes and pre-trained models will be made available at: https://github.com/VITA-Group/CV_LTH_Pre-training.",
  "s2id": "5f6fccc32953f57fe29b2316eb8351e84b0179dc",
  "twitter": {
    "retweets": 5,
    "likes": 12,
    "replies": 0,
    "ids": [
      "1377103917293596674",
      "1338862880230232071",
      "1377239583637770242",
      "1377194403345891328",
      "1377345326659510274",
      "1377073545029812228",
      "1338871907601555467",
      "1338675383634432003"
    ]
  },
  "citations": 15,
  "posterSession": "Friday"
}