{
  "arXiv": "http://arxiv.org/abs/2103.16148",
  "title": "Class-Aware Robust Adversarial Training for Object Detection",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Chen_Class-Aware_Robust_Adversarial_Training_for_Object_Detection_CVPR_2021_paper.pdf",
  "authors": [
    "Pin-Chun Chen",
    "Bo-Han Kung",
    "Jun-Cheng Chen"
  ],
  "abstract": "Object detection is an important computer vision task with plenty of real-world applications; therefore, how to enhance its robustness against adversarial attacks has emerged as a crucial issue. However, most of the previous defense methods focused on the classification task and had few analysis in the context of the object detection task. In this work, to address the issue, we present a novel class-aware robust adversarial training paradigm for the object detection task. For a given image, the proposed approach generates a universal adversarial perturbation to simultaneously attack all the occurred objects in the image through jointly maximizing the respective loss for each object. Meanwhile, instead of normalizing the total loss with the number of objects, the proposed approach decomposes the total loss into class-wise losses and normalizes each class loss using the number of objects for the class. The adversarial training based on the class weighted loss can not only balances the influence of each class but also effectively and evenly improves the adversarial robustness of trained models for all the object classes as compared with the previous defense methods. Furthermore, with the recent development of fast adversarial training, we provide a fast version of the proposed algorithm which can be trained faster than the traditional adversarial training while keeping comparable performance. With extensive experiments on the challenging PASCAL-VOC and MS-COCO datasets, the evaluation results demonstrate that the proposed defense methods can effectively enhance the robustness of the object detection models.",
  "s2id": "3ee182c703188b77343bc06df7758ef7d23d214b",
  "citations": 0,
  "posterSession": "Wednesday"
}