{
  "arXiv": "http://arxiv.org/abs/2006.02049",
  "title": "FBNetV3: Joint Architecture-Recipe Search Using Predictor Pretraining",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Dai_FBNetV3_Joint_Architecture-Recipe_Search_Using_Predictor_Pretraining_CVPR_2021_paper.pdf",
  "authors": [
    "Xiaoliang Dai",
    "Alvin Wan",
    "Peizhao Zhang",
    "Bichen Wu",
    "Zijian He",
    "Zhen Wei",
    "Kan Chen",
    "Yuandong Tian",
    "Matthew Yu",
    "Peter Vajda",
    "Joseph E. Gonzalez"
  ],
  "abstract": "Neural Architecture Search (NAS) yields state-of-the-art neural networks that outperform their best manually-designed counterparts. However, previous NAS methods search for architectures under one set of training hyper-parameters (i.e., a training recipe), overlooking superior architecture-recipe combinations. To address this, we present Neural Architecture-Recipe Search (NARS) to search both (a) architectures and (b) their corresponding training recipes, simultaneously. NARS utilizes an accuracy predictor that scores architecture and training recipes jointly, guiding both sample selection and ranking. Furthermore, to compensate for the enlarged search space, we leverage \"free\" architecture statistics (e.g., FLOP count) to pretrain the predictor, significantly improving its sample efficiency and prediction reliability. After training the predictor via constrained iterative optimization, we run fast evolutionary searches in just CPU minutes to generate architecture-recipe pairs for a variety of resource constraints, called FBNetV3. FBNetV3 makes up a family of state-of-the-art compact neural networks that outperform both automatically and manually-designed competitors. For example, FBNetV3 matches both EfficientNet and ResNeSt accuracy on ImageNet with up to 2.0x and 7.1x fewer FLOPs, respectively. Furthermore, FBNetV3 yields significant performance gains for downstream object detection tasks, improving mAP despite 18% fewer FLOPs and 34% fewer parameters than EfficientNet-based equivalents.",
  "s2id": "",
  "twitter": {
    "retweets": 9,
    "likes": 15,
    "replies": 4,
    "ids": [
      "1268543321112301568",
      "1268378961077125122",
      "1273997650963152897",
      "1270169090968223747",
      "1268538293244870662",
      "1271509670189060100",
      "1270440775977963530",
      "1270244585168568320",
      "1270214287802294274",
      "1268523201031593984",
      "1268438413654609927",
      "1268392601419464704",
      "1268380284380237825",
      "1268375079047639040",
      "1268356931439165442",
      "1268355811916513280"
    ]
  },
  "posterSession": "Friday"
}