{
  "arXiv": "http://arxiv.org/abs/2105.09156",
  "title": "Generalizable Person Re-Identification With Relevance-Aware Mixture of Experts",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Dai_Generalizable_Person_Re-Identification_With_Relevance-Aware_Mixture_of_Experts_CVPR_2021_paper.pdf",
  "authors": [
    "Yongxing Dai",
    "Xiaotong Li",
    "Jun Liu",
    "Zekun Tong",
    "Ling-Yu Duan"
  ],
  "abstract": "Domain generalizable (DG) person re-identification (ReID) is a challenging problem because we cannot access any unseen target domain data during training. Almost all the existing DG ReID methods follow the same pipeline where they use a hybrid dataset from multiple source domains for training, and then directly apply the trained model to the unseen target domains for testing. These methods often neglect individual source domains' discriminative characteristics and their relevances w.r.t. the unseen target domains, though both of which can be leveraged to help the model's generalization. To handle the above two issues, we propose a novel method called the relevance-aware mixture of experts (RaMoE), using an effective voting-based mixture mechanism to dynamically leverage source domains' diverse characteristics to improve the model's generalization. Specifically, we propose a decorrelation loss to make the source domain networks (experts) keep the diversity and discriminability of individual domains' characteristics. Besides, we design a voting network to adaptively integrate all the experts' features into the more generalizable aggregated features with domain relevance. Considering the target domains' invisibility during training, we propose a novel learning-to-learn algorithm combined with our relation alignment loss to update the voting network. Extensive experiments demonstrate that our proposed RaMoE outperforms the state-of-the-art methods.",
  "s2id": "7ffbc531bbb0f1cf38b47e1d728a0e297f8b4dec",
  "twitter": {
    "retweets": 1,
    "likes": 3,
    "replies": 0
  },
  "citations": 1
}