{
  "arXiv": "http://arxiv.org/abs/2103.07889",
  "title": "Learning a Proposal Classifier for Multiple Object Tracking",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Dai_Learning_a_Proposal_Classifier_for_Multiple_Object_Tracking_CVPR_2021_paper.pdf",
  "authors": [
    "Peng Dai",
    "Renliang Weng",
    "Wongun Choi",
    "Changshui Zhang",
    "Zhangping He",
    "Wei Ding"
  ],
  "abstract": "The recent trend in multiple object tracking (MOT) is heading towards leveraging deep learning to boost the tracking performance. However, it is not trivial to solve the data-association problem in an end-to-end fashion. In this paper, we propose a novel proposal-based learnable framework, which models MOT as a proposal generation, proposal scoring and trajectory inference paradigm on an affinity graph. This framework is similar to the two-stage object detector Faster RCNN, and can solve the MOT problem in a data-driven way. For proposal generation, we propose an iterative graph clustering method to reduce the computational cost while maintaining the quality of the generated proposals. For proposal scoring, we deploy a trainable graph-convolutional-network (GCN) to learn the structural patterns of the generated proposals and rank them according to the estimated quality scores. For trajectory inference, a simple deoverlapping strategy is adopted to generate tracking output while complying with the constraints that no detection can be assigned to more than one track. We experimentally demonstrate that the proposed method achieves a clear performance improvement in both MOTA and IDF1 with respect to previous state-of-the-art on two public benchmarks. Our code is available at https://github.com/daip13/LPC_MOT.git.",
  "s2id": "540f718e7d085fadfcce0c7649ab604a36995776",
  "twitter": {
    "retweets": 0,
    "likes": 0,
    "replies": 0,
    "ids": [
      "1376530029086187520",
      "1376348746234142725",
      "1374732901422673920",
      "1374642434018222080",
      "1374536798865653768",
      "1371818757740494851",
      "1371637509956964355"
    ]
  },
  "citations": 3,
  "posterSession": "Monday"
}