{
  "arXiv": "http://arxiv.org/abs/2003.00707",
  "title": "Unbiased Mean Teacher for Cross-Domain Object Detection",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Deng_Unbiased_Mean_Teacher_for_Cross-Domain_Object_Detection_CVPR_2021_paper.pdf",
  "authors": [
    "Jinhong Deng",
    "Wen Li",
    "Yuhua Chen",
    "Lixin Duan"
  ],
  "abstract": "Cross-domain object detection is challenging, because object detection model is often vulnerable to data variance, especially to the considerable domain shift between two distinctive domains. In this paper, we propose a new Unbiased Mean Teacher (UMT) model for cross-domain object detection. We reveal that there often exists a considerable model bias for the simple mean teacher (MT) model in cross-domain scenarios, and eliminate the model bias with several simple yet highly effective strategies. In particular, for the teacher model, we propose a cross-domain distillation for MT to maximally exploit the expertise of the teacher model. Second, for the student model, we also alleviate its bias by augmenting training samples with pixel-level adaptation. Finally, for the teaching process, we employ an out-of-distribution estimation strategy to select samples that most fit the current model to further enhance the cross-domain distillation process. By tackling the model bias issue with these strategies, our UMT model achieves mAPs of 44.1%, 58.1%, 41.7%, and 43.1% on benchmark datasets Clipart1k, Watercolor2k, Foggy Cityscapes, and Cityscapes, respectively, which outperforms the existing state-of-the-art results in notable margins. Our implementation is available at https://github.com/kinredon/umt.",
  "s2id": "a55d93cc7291319a366a82905c79f39296f4198c",
  "twitter": {
    "retweets": 1,
    "likes": 0,
    "replies": 1,
    "ids": [
      "1235039298442805248",
      "1235036912655589376",
      "1234989883640315904",
      "1234972050487304193",
      "1234881390073860097",
      "1234685309201375232",
      "1234669981385678856"
    ]
  },
  "citations": 1,
  "posterSession": "Tuesday"
}