{
  "arXiv": "http://arxiv.org/abs/2103.13425",
  "title": "Diverse Branch Block: Building a Convolution as an Inception-Like Unit",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Ding_Diverse_Branch_Block_Building_a_Convolution_as_an_Inception-Like_Unit_CVPR_2021_paper.pdf",
  "authors": [
    "Xiaohan Ding",
    "Xiangyu Zhang",
    "Jungong Han",
    "Guiguang Ding"
  ],
  "abstract": "We propose a universal building block of Convolutional Neural Network (ConvNet) to improve the performance without any inference-time costs. The block is named Diverse Branch Block (DBB), which enhances the representational capacity of a single convolution by combining diverse branches of different scales and complexities to enrich the feature space, including sequences of convolutions, multi-scale convolutions, and average pooling. After training, a DBB can be equivalently converted into a single conv layer for deployment. Unlike the advancements of novel ConvNet architectures, DBB complicates the training-time microstructure while maintaining the macro architecture, so that it can be used as a drop-in replacement for regular conv layers of any architecture. In this way, the model can be trained to reach a higher level of performance and then transformed into the original inference-time structure for inference. DBB improves ConvNets on image classification (up to 1.9% higher top-1 accuracy on ImageNet), object detection and semantic segmentation. The PyTorch code and models are released at https://github.com/DingXiaoH/DiverseBranchBlock.",
  "s2id": "1f34aee634327c6d4f13f9018c34df4d3239ecb6",
  "twitter": {
    "retweets": 0,
    "likes": 0,
    "replies": 1,
    "ids": [
      "1376937407250100228",
      "1376922572885913602",
      "1376726295111999489",
      "1376227872952750081",
      "1376046639199223810",
      "1375850347609133056",
      "1375835089402089476",
      "1375638830011846656",
      "1375609321099304961",
      "1375518082773356545",
      "1375442638640406528",
      "1375261303774797827"
    ]
  },
  "citations": 0,
  "posterSession": "Wednesday"
}