{
  "arXiv": "http://arxiv.org/abs/2103.06877",
  "title": "Fast and Accurate Model Scaling",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Dollar_Fast_and_Accurate_Model_Scaling_CVPR_2021_paper.pdf",
  "authors": [
    "Piotr Dollar",
    "Mannat Singh",
    "Ross Girshick"
  ],
  "abstract": "In this work we analyze strategies for convolutional neural network scaling; that is, the process of scaling a base convolutional network to endow it with greater computational complexity and consequently representational power. Example scaling strategies may include increasing model width, depth, resolution, etc. While various scaling strategies exist, their tradeoffs are not fully understood. Existing analysis typically focuses on the interplay of accuracy and flops (floating point operations). Yet, as we demonstrate, various scaling strategies affect model parameters, activations, and consequently actual runtime quite differently. In our experiments we show the surprising result that numerous scaling strategies yield networks with similar accuracy but with widely varying properties. This leads us to propose a simple fast compound scaling strategy that encourages primarily scaling model width, while scaling depth and resolution to a lesser extent. Unlike currently popular scaling strategies, which result in about O(s) increase in model activation w.r.t. scaling flops by a factor of s, the proposed fast compound scaling results in close to O(sqrt s ) increase in activations, while achieving excellent accuracy. Fewer activations leads to speedups on modern memory-bandwidth limited hardware (e.g., GPUs). More generally, we hope this work provides a framework for analyzing scaling strategies under various computational constraints.",
  "s2id": "73d5dbfebca74e5ef8a7333c842a2a9ee5c07fd6",
  "twitter": {
    "retweets": 19,
    "likes": 111,
    "replies": 3,
    "ids": [
      "1370189948922462208",
      "1371120639122280450",
      "1370213530767667201",
      "1370525239755616257",
      "1370384347476459520",
      "1370203897655128075"
    ]
  },
  "citations": 3,
  "posterSession": "Monday"
}