{
  "arXiv": "http://arxiv.org/abs/2012.04746",
  "title": "Robust Neural Routing Through Space Partitions for Camera Relocalization in Dynamic Indoor Environments",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Dong_Robust_Neural_Routing_Through_Space_Partitions_for_Camera_Relocalization_in_CVPR_2021_paper.pdf",
  "authors": [
    "Siyan Dong",
    "Qingnan Fan",
    "He Wang",
    "Ji Shi",
    "Li Yi",
    "Thomas Funkhouser",
    "Baoquan Chen",
    "Leonidas J. Guibas"
  ],
  "abstract": "Localizing the camera in a known indoor environment is a key building block for scene mapping, robot navigation, AR, etc. Recent advances estimate the camera pose via optimization over the 2D/3D-3D correspondences established between the coordinates in 2D/3D camera space and 3D world space. Such a mapping is estimated with either a convolution neural network or a decision tree using only the static input image sequence, which makes these approaches vulnerable to dynamic indoor environments that are quite common yet challenging in the real world. To address the aforementioned issues, in this paper, we propose a novel outlier-aware neural tree which bridges the two worlds, deep learning and decision tree approaches. It builds on three important blocks: (a) a hierarchical space partition over the indoor scene to construct the decision tree; (b) a neural routing function, implemented as a deep classification network, employed for better 3D scene understanding; and (c) an outlier rejection module used to filter out dynamic points during the hierarchical routing process. Our proposed algorithm is evaluated on the RIO-10 benchmark developed for camera relocalization in dynamic indoor environments. It achieves robust neural routing through space partitions and outperforms the state-of-the-art approaches by around 30% on camera pose accuracy, while running comparably fast for evaluation.",
  "s2id": "5249d188beda2ec2820834fc932e6da1f5902feb",
  "twitter": {
    "retweets": 2,
    "likes": 13,
    "replies": 1
  },
  "citations": 1
}