{
  "arXiv": "http://arxiv.org/abs/2012.11575",
  "title": "From Points to Multi-Object 3D Reconstruction",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Engelmann_From_Points_to_Multi-Object_3D_Reconstruction_CVPR_2021_paper.pdf",
  "authors": [
    "Francis Engelmann",
    "Konstantinos Rematas",
    "Bastian Leibe",
    "Vittorio Ferrari"
  ],
  "abstract": "We propose a method to detect and reconstruct multiple 3D objects from a single RGB image. The key idea is to optimize for detection, alignment and shape jointly over all objects in the RGB image, while focusing on realistic and physically plausible reconstructions. To this end, we propose a key-point detector that localizes objects as center points and directly predicts all object properties, including 9-DoF bounding boxes and 3D shapes, all in a single forward pass. The method formulates 3D shape reconstruction as a shape selection problem, i.e. it selects among exemplar shapes from a given database. This makes it agnostic to shape representations, which enables a lightweight reconstruction of realistic and visually-pleasing shapes based on CAD-models, while the training objective is formulated around point clouds and voxel representations. A collision-loss promotes non-intersecting objects, further increasing the reconstruction realism. Given the RGB image, the presented approach performs lightweight reconstruction in a single-stage, it is real-time capable, fully differentiable and end-to-end trainable. Our experiments compare multiple approaches for 9-DoF bounding box estimation, evaluate the novel shape-selection mechanism and compare to recent methods in terms of 3D bounding box estimation and 3D shape reconstruction quality.",
  "s2id": "73c8124a5d1dd175d9e3555ea9c52082b63a599c",
  "twitter": {
    "retweets": 8,
    "likes": 65,
    "replies": 0,
    "ids": [
      "1380494048348233730",
      "1341491236855631872",
      "1381301276319834119",
      "1380470871836422144",
      "1380334883483045888",
      "1381119968260030465",
      "1380923821084016645",
      "1380727404134600708",
      "1380712415529209857",
      "1380516159112511497"
    ]
  },
  "citations": 1,
  "posterSession": "Tuesday"
}