{
  "arXiv": "http://arxiv.org/abs/2106.01899",
  "title": "Adversarially Adaptive Normalization for Single Domain Generalization",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Fan_Adversarially_Adaptive_Normalization_for_Single_Domain_Generalization_CVPR_2021_paper.pdf",
  "authors": [
    "Xinjie Fan",
    "Qifei Wang",
    "Junjie Ke",
    "Feng Yang",
    "Boqing Gong",
    "Mingyuan Zhou"
  ],
  "abstract": "Single domain generalization aims to learn a model that performs well on many unseen domains with only one domain data for training. Existing works focus on studying the adversarial domain augmentation (ADA) to improve the model's generalization capability. The impact on domain generalization from the statistics of normalization layers is still underinvestigated. In this paper, we propose a generic normalization approach, adaptive standardization and rescaling normalization (ASR-Norm), to complement the missing part in the previous works. ASR-Norm learns both the standardization and rescaling statistics via neural networks. This new form of normalization can be viewed as a generic form of traditional normalizations. When trained with ADA, the statistics in ASR-Norm are learned to be adaptive to the data coming from different domains, and hence improves the model generalization performance across domains, especially on the target domain with large discrepancy from the source domain. The experimental results show that ASR-Norm can bring consistent improvement to the state-of-the-art ADA approaches by 1.6%, 2.7%, and 6.3% averagely on the Digits, CIFAR-10-C, and PACS benchmarks, respectively. As a generic tool, the improvement introduced by ASR-Norm is agnostic to the choice of ADA methods.",
  "s2id": "648c13c77a94d46b2dbd75c8073cca4b8870bd9f",
  "twitter": {
    "retweets": 5,
    "likes": 30,
    "replies": 1,
    "ids": [
      "1400649618044723206",
      "1400921558546223104",
      "1402093154627641353",
      "1402093275700473858",
      "1401594998722809862",
      "1401021298684407813",
      "1400825088388239365"
    ]
  },
  "citations": 0,
  "posterSession": "Wednesday"
}