{
  "arXiv": "http://arxiv.org/abs/2012.03753",
  "title": "Unsupervised Pre-Training for Person Re-Identification",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Fu_Unsupervised_Pre-Training_for_Person_Re-Identification_CVPR_2021_paper.pdf",
  "authors": [
    "Dengpan Fu",
    "Dongdong Chen",
    "Jianmin Bao",
    "Hao Yang",
    "Lu Yuan",
    "Lei Zhang",
    "Houqiang Li",
    "Dong Chen"
  ],
  "abstract": "In this paper, we present a large scale unlabeled person re-identification (Re-ID) dataset \"LUPerson\" and make the first attempt of performing unsupervised pre-training for improving the generalization ability of the learned person Re-ID feature representation. This is to address the problem that all existing person Re-ID datasets are all of limited scale due to the costly effort required for data annotation. Previous research tries to leverage models pre-trained on ImageNet to mitigate the shortage of person Re-ID data but suffers from the large domain gap between ImageNet and person Re-ID data. LUPerson is an unlabeled dataset of 4M images of over 200K identities, which is 30xlarger than the largest existing Re-ID dataset. It also covers a much diverse range of capturing environments (e.g., camera settings, scenes, etc.). Based on this dataset, we systematically study the key factors for learning Re-ID features from two perspectives: data augmentation and contrastive loss. Unsupervised pre-training performed on this large-scale dataset effectively leads to a generic Re-ID feature that can benefit all existing person Re-ID methods. Using our pre-trained model in some basic frameworks, our methods achieve state-of-the-art results without bells and whistles on four widely used Re-ID datasets: CUHK03, Market1501, DukeMTMC, and MSMT17. Our results also show that the performance improvement is more significant on small-scale target datasets or under few-shot setting.",
  "s2id": "2309f2c7db994dc8aeb1da3288cdf75dc8ec0194",
  "twitter": {
    "retweets": 1,
    "likes": 2,
    "replies": 0,
    "ids": [
      "1337248565232500739"
    ]
  },
  "citations": 0,
  "posterSession": "Thursday"
}