{
  "arXiv": "http://arxiv.org/abs/2105.10203",
  "title": "Omni-Supervised Point Cloud Segmentation via Gradual Receptive Field Component Reasoning",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Gong_Omni-Supervised_Point_Cloud_Segmentation_via_Gradual_Receptive_Field_Component_Reasoning_CVPR_2021_paper.pdf",
  "authors": [
    "Jingyu Gong",
    "Jiachen Xu",
    "Xin Tan",
    "Haichuan Song",
    "Yanyun Qu",
    "Yuan Xie",
    "Lizhuang Ma"
  ],
  "abstract": "Hidden features in neural network usually fail to learn informative representation for 3D segmentation as supervisions are only given on output prediction, while this can be solved by omni-scale supervision on intermediate layers. In this paper, we bring the first omni-scale supervision method to point cloud segmentation via the proposed gradual Receptive Field Component Reasoning (RFCR), where target Receptive Field Component Codes (RFCCs) are designed to record categories within receptive fields for hidden units in the encoder. Then, target RFCCs will supervise the decoder to gradually infer the RFCCs in a coarse-to-fine categories reasoning manner, and finally obtain the semantic labels. Because many hidden features are inactive with tiny magnitude and make minor contributions to RFCC prediction, we propose a Feature Densification with a centrifugal potential to obtain more unambiguous features, and it is in effect equivalent to entropy regularization over features. More active features can further unleash the potential of our omni-supervision method. We embed our method into four prevailing backbones and test on three challenging benchmarks. Our method can significantly improve the backbones in all three datasets. Specifically, our method brings new state-of-the-art performances for S3DIS as well as Semantic3D and ranks the 1st in the ScanNet benchmark among all the point-based methods. Code is publicly available at https://github.com/azuki-miho/RFCR.",
  "s2id": "ec037c60723619b5e0c194fba6b5e91bd4f67917",
  "citations": 0,
  "posterSession": "Thursday"
}