{
  "arXiv": "http://arxiv.org/abs/2103.02148",
  "title": "Multi-Institutional\n Collaborations for Improving Deep Learning-Based Magnetic Resonance \nImage Reconstruction Using Federated Learning",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Guo_Multi-Institutional_Collaborations_for_Improving_Deep_Learning-Based_Magnetic_Resonance_Image_Reconstruction_CVPR_2021_paper.pdf",
  "authors": [
    "Pengfei Guo",
    "Puyang Wang",
    "Jinyuan Zhou",
    "Shanshan Jiang",
    "Vishal M. Patel"
  ],
  "abstract": "Fast and accurate reconstruction of magnetic resonance (MR) images from under-sampled data is important in many clinical applications. In recent years, deep learning-based methods have been shown to produce superior performance on MR image reconstruction. However, these methods require large amounts of data which is difficult to collect and share due to the high cost of acquisition and medical data privacy regulations. In order to overcome this challenge, we propose a federated learning (FL) based solution in which we take advantage of the MR data available at different institutions while preserving patients' privacy. However, the generalizability of models trained with the FL setting can still be suboptimal due to domain shift, which results from the data collected at multiple institutions with different sensors, disease types, and acquisition protocols, etc. With the motivation of circumventing this challenge, we propose a cross-site modeling for MR image reconstruction in which the learned intermediate latent features among different source sites are aligned with the distribution of the latent features at the target site. Extensive experiments are conducted to provide various insights about FL for MR image reconstruction. Experimental results demonstrate that the proposed framework is a promising direction to utilize multi-institutional data without compromising patients' privacy for achieving improved MR image reconstruction. Our code is available at https://github.com/guopengf/FL-MRCM",
  "s2id": "245df7d8e53b3860107edc76b467e055eb80744d",
  "citations": 0
}