{
  "arXiv": "http://arxiv.org/abs/2003.08799",
  "title": "Generalizable Pedestrian Detection: The Elephant in the Room",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Hasan_Generalizable_Pedestrian_Detection_The_Elephant_in_the_Room_CVPR_2021_paper.pdf",
  "authors": [
    "Irtiza Hasan",
    "Shengcai Liao",
    "Jinpeng Li",
    "Saad Ullah Akram",
    "Ling Shao"
  ],
  "abstract": "Pedestrian detection is used in many vision based applications ranging from video surveillance to autonomous driving. Despite achieving high performance, it is still largely unknown how well existing detectors generalize to unseen data. This is important because a practical detector should be ready to use in various scenarios in applications. To this end, we conduct a comprehensive study in this paper, using a general principle of direct cross-dataset evaluation. Through this study, we find that existing state-of-the-art pedestrian detectors, though perform quite well when trained and tested on the same dataset, generalize poorly in cross dataset evaluation. We demonstrate that there are two reasons for this trend. Firstly, their designs (e.g. anchor settings) may be biased towards popular benchmarks in the traditional single-dataset training and test pipeline, but as a result largely limit their generalization capability. Secondly, the training source is generally not dense in pedestrians and diverse in scenarios. Under direct cross-dataset evaluation, surprisingly, we find that a general purpose object detector, without pedestrian-tailored adaptation in design, generalizes much better compared to existing state-of-the-art pedestrian detectors. Furthermore, we illustrate that diverse and dense datasets, collected by crawling the web, serve to be an efficient source of pre-training for pedestrian detection. Accordingly, we propose a progressive training pipeline and find that it works well for autonomous-driving oriented pedestrian detection. Consequently, the study conducted in this paper suggests that more emphasis should be put on cross-dataset evaluation for the future design of generalizable pedestrian detectors. Code and models can be accessed at https://github.com/hasanirtiza/Pedestron.",
  "s2id": "39e502f7d74eeb041601d7d6e165f324e194c5dd",
  "twitter": {
    "retweets": 6,
    "likes": 14,
    "replies": 2,
    "ids": [
      "1240800465832546305",
      "1242447575011209216",
      "1241374365091909633",
      "1282142920926203905",
      "1281961573972664320",
      "1280315997455634434",
      "1290070218048405510",
      "1241540433374781441",
      "1242556344881856515",
      "1289934131632070656",
      "1242265142009704449",
      "1241831633566797824",
      "1241751721543643137",
      "1241736618723041281",
      "1289647202101596160",
      "1245938632088748032",
      "1241359230357188610",
      "1241162937416499201",
      "1241092596161810435",
      "1240981685094801409",
      "1240840890567933959",
      "1240818657674092549",
      "1243885097717243907",
      "1258210066060259329",
      "1289541593356091392",
      "1289722924903981056",
      "1289420985200979968",
      "1289360331383255041",
      "1289239708271337472",
      "1289164015940169728",
      "1289013112214032385",
      "1282339103871315968",
      "1289858596965093376",
      "1258391406294548482",
      "1281765497600724992",
      "1281584219744014337",
      "1281402916184752130",
      "1280512268451618819",
      "1336863370830630912",
      "1258512049279078400",
      "1337044809580765186"
    ]
  },
  "citations": 3,
  "posterSession": "Wednesday"
}