{
  "arXiv": "http://arxiv.org/abs/2011.15128",
  "title": "Animating Pictures With Eulerian Motion Fields",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Holynski_Animating_Pictures_With_Eulerian_Motion_Fields_CVPR_2021_paper.pdf",
  "authors": [
    "Aleksander Holynski",
    "Brian L. Curless",
    "Steven M. Seitz",
    "Richard Szeliski"
  ],
  "abstract": "In this paper, we demonstrate a fully automatic method for converting a still image into a realistic animated looping video. We target scenes with continuous fluid motion, such as flowing water and billowing smoke. Our method relies on the observation that this type of natural motion can be convincingly reproduced from a static Eulerian motion description, i.e. a single, temporally constant flow field that defines the immediate motion of a particle at a given 2D location. We use an image-to-image translation network to encode motion priors of natural scenes collected from online videos, so that for a new photo, we can synthesize a corresponding motion field. The image is then animated using the generated motion through a deep warping technique: pixels are encoded as deep features, those features are warped via Eulerian motion, and the resulting warped feature maps are decoded as images. In order to produce continuous, seamlessly looping video textures, we propose a novel video looping technique that flows features both forward and backward in time and then blends the results. We demonstrate the effectiveness and robustness of our method by applying it to a large collection of examples including beaches, waterfalls, and flowing rivers.",
  "s2id": "a9eb5c59763b5da7a9a0e1c5ef543b2f02630feb",
  "twitter": {
    "retweets": 173,
    "likes": 577,
    "replies": 1,
    "ids": [
      "1333693426064191489",
      "1393091243656232960",
      "1365533476712157187",
      "1384644975346991110",
      "1333890369512230912",
      "1335860330488975361",
      "1365918116060958720",
      "1338182091771506688",
      "1390958119065427969",
      "1335761621709287424",
      "1335162002487058432",
      "1365966276728819713",
      "1333698727245189120",
      "1384899253143756808",
      "1333612477485961218",
      "1333603510558986240",
      "1333592193257398272"
    ]
  },
  "citations": 2,
  "posterSession": "Tuesday"
}