{
  "arXiv": "http://arxiv.org/abs/2103.07152",
  "title": "Deep Gaussian Scale Mixture Prior for Spectral Compressive Imaging",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Huang_Deep_Gaussian_Scale_Mixture_Prior_for_Spectral_Compressive_Imaging_CVPR_2021_paper.pdf",
  "authors": [
    "Tao Huang",
    "Weisheng Dong",
    "Xin Yuan",
    "Jinjian Wu",
    "Guangming Shi"
  ],
  "abstract": "In coded aperture snapshot spectral imaging (CASSI) system, the real-world hyperspectral image (HSI) can be reconstructed from the captured compressive image in a snapshot. Model-based HSI reconstruction methods employed hand-crafted priors to solve the reconstruction problem, but most of which achieved limited success due to the poor representation capability of these hand-crafted priors. Deep learning based methods learning the mappings between the compressive images and the HSIs directly achieved much better results. Yet, it is nontrivial to design a powerful deep network heuristically for achieving satisfied results. In this paper, we propose a novel HSI reconstruction method based on the Maximum a Posterior (MAP) estimation framework using learned Gaussian Scale Mixture (GSM) prior. Different from existing GSM models using hand-crafted scale priors (e.g., the Jeffrey's prior), we propose to learn the scale prior through a deep convolutional neural network (DCNN). Furthermore, we also propose to estimate the local means of the GSM models by the DCNN. All the parameters of the MAP estimation algorithm and the DCNN parameters are jointly optimized through end-to-end training. Extensive experimental results on both synthetic and real datasets demonstrate that the proposed method outperforms existing state-of-the-art methods. The code is available at https://see.xidian.edu.cn/faculty/wsdong/Projects/DGSM-SCI.htm.",
  "s2id": "1cb314bbc7eec504d29632941331e3eaef9a82b0",
  "twitter": {
    "retweets": 1,
    "likes": 3,
    "replies": 1
  },
  "citations": 3,
  "posterSession": "Friday"
}