{
  "arXiv": "http://arxiv.org/abs/2103.01520",
  "title": "When Age-Invariant Face Recognition Meets Face Age Synthesis: A Multi-Task Learning Framework",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Huang_When_Age-Invariant_Face_Recognition_Meets_Face_Age_Synthesis_A_Multi-Task_CVPR_2021_paper.pdf",
  "authors": [
    "Zhizhong Huang",
    "Junping Zhang",
    "Hongming Shan"
  ],
  "abstract": "To minimize the effects of age variation in face recognition, previous work either extracts identity-related discriminative features by minimizing the correlation between identity- and age-related features, called age-invariant face recognition (AIFR), or removes age variation by transforming the faces of different age groups into the same age group, called face age synthesis (FAS); however, the former lacks visual results for model interpretation while the latter suffers from artifacts compromising downstream recognition. Therefore, this paper proposes a unified, multi-task framework to jointly handle these two tasks, termed MTLFace, which can learn age-invariant identity-related representation while achieving pleasing face synthesis. Specifically, we first decompose the mixed face features into two uncorrelated components---identity- and age-related features---through an attention mechanism, and then decorrelate these two components using multi-task training and continuous domain adaption. In contrast to the conventional one-hot encoding that achieves group-level FAS, we propose a novel identity conditional module to achieve identity-level FAS, with a weight-sharing strategy to improve the age smoothness of synthesized faces. In addition, we collect and release a large cross-age face dataset with age and gender annotations to advance AIFR and FAS. Extensive experiments on five benchmark cross-age datasets demonstrate the superior performance of our proposed MTLFace over state-of-the-art methods for AIFR and FAS. We further validate MTLFace on two popular general face recognition datasets, showing competitive performance for face recognition in the wild. The source code and dataset are available at https://github.com/Hzzone/MTLFace.",
  "s2id": "bf5bbcb455e9d8976a04dd5bcdd74e5773c96b0f",
  "twitter": {
    "retweets": 2,
    "likes": 16,
    "replies": 2,
    "ids": [
      "1368487690585317376",
      "1368072654717128715",
      "1367293964806590465"
    ]
  },
  "citations": 2,
  "posterSession": "Wednesday"
}