{
  "arXiv": "http://arxiv.org/abs/2011.12646",
  "title": "Quantifying Explainers of Graph Neural Networks in Computational Pathology",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Jaume_Quantifying_Explainers_of_Graph_Neural_Networks_in_Computational_Pathology_CVPR_2021_paper.pdf",
  "authors": [
    "Guillaume Jaume",
    "Pushpak Pati",
    "Behzad Bozorgtabar",
    "Antonio Foncubierta",
    "Anna Maria Anniciello",
    "Florinda Feroce",
    "Tilman Rau",
    "Jean-Philippe Thiran",
    "Maria Gabrani",
    "Orcun Goksel"
  ],
  "abstract": "Explainability of deep learning methods is imperative to facilitate their clinical adoption in digital pathology. However, popular deep learning methods and explainability techniques (explainers) based on pixel-wise processing disregard biological entities' notion, thus complicating comprehension by pathologists. In this work, we address this by adopting biological entity-based graph processing and graph explainers enabling explanations accessible to pathologists. In this context, a major challenge becomes to discern meaningful explainers, particularly in a standardized and quantifiable fashion. To this end, we propose herein a set of novel quantitative metrics based on statistics of class separability using pathologically measurable concepts to characterize graph explainers. We employ the proposed metrics to evaluate three types of graph explainers, namely the layer-wise relevance propagation, gradient-based saliency, and graph pruning approaches, to explain Cell-Graph representations for Breast Cancer Subtyping. The proposed metrics are also applicable in other domains by using domain-specific intuitive concepts. We validate the qualitative and quantitative findings on the BRACS dataset, a large cohort of breast cancer RoIs, by expert pathologists. The code and models will be released upon acceptance.",
  "s2id": "8b55b106aae751553ec44fb30ec780e05ca74980",
  "twitter": {
    "retweets": 10,
    "likes": 29,
    "replies": 2,
    "ids": [
      "1367190080700481541",
      "1333246763365322754",
      "1381559928494624768",
      "1394286913507450885",
      "1394105618638770178",
      "1331986194121576450",
      "1331791820674785280"
    ]
  },
  "citations": 4,
  "posterSession": "Wednesday"
}