{
  "arXiv": "http://arxiv.org/abs/2003.07849",
  "title": "Blur, Noise, and Compression Robust Generative Adversarial Networks",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Kaneko_Blur_Noise_and_Compression_Robust_Generative_Adversarial_Networks_CVPR_2021_paper.pdf",
  "authors": [
    "Takuhiro Kaneko",
    "Tatsuya Harada"
  ],
  "abstract": "Generative adversarial networks (GANs) have gained considerable attention owing to their ability to reproduce images. However, they can recreate training images faithfully despite image degradation in the form of blur, noise, and compression, generating similarly degraded images. To solve this problem, the recently proposed noise robust GAN (NR-GAN) provides a partial solution by demonstrating the ability to learn a clean image generator directly from noisy images using a two-generator model comprising image and noise generators. However, its application is limited to noise, which is relatively easy to decompose owing to its additive and reversible characteristics, and its application to irreversible image degradation, in the form of blur, compression, and combination of all, remains a challenge. To address these problems, we propose blur, noise, and compression robust GAN (BNCR-GAN) that can learn a clean image generator directly from degraded images without knowledge of degradation parameters (e.g., blur kernel types, noise amounts, or quality factor values). Inspired by NR-GAN, BNCR-GAN uses a multiple-generator model composed of image, blur-kernel, noise, and quality-factor generators. However, in contrast to NR-GAN, to address irreversible characteristics, we introduce masking architectures adjusting degradation strength values in a data-driven manner using bypasses before and after degradation. Furthermore, to suppress uncertainty caused by the combination of blur, noise, and compression, we introduce adaptive consistency losses imposing consistency between irreversible degradation processes according to the degradation strengths. We demonstrate the effectiveness of BNCR-GAN through large-scale comparative studies on CIFAR-10 and a generality analysis on FFHQ. In addition, we demonstrate the applicability of BNCR-GAN in image restoration.",
  "s2id": "40f37fb14465a70a90cd46ecfc687bceeff7bb46",
  "twitter": {
    "retweets": 30,
    "likes": 110,
    "replies": 6,
    "ids": [
      "1240078615926190080",
      "1241059818787549184",
      "1242817397393747969",
      "1242808273109016579",
      "1242808409935601665",
      "1242251462584889344",
      "1240133856046481408",
      "1240130002647121922",
      "1240389790513745920",
      "1240093319574716416",
      "1302014697076592640",
      "1240111903122370562",
      "1240095739885182979",
      "1240271865135988737",
      "1240112019115835393",
      "1240114449501097984",
      "1242917961188249605",
      "1240688143054987264",
      "1240075797999898625"
    ]
  },
  "citations": 1,
  "posterSession": "Thursday"
}