{
  "arXiv": "http://arxiv.org/abs/2012.10974",
  "title": "High-Fidelity Neural Human Motion Transfer From Monocular Video",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Kappel_High-Fidelity_Neural_Human_Motion_Transfer_From_Monocular_Video_CVPR_2021_paper.pdf",
  "authors": [
    "Moritz Kappel",
    "Vladislav Golyanik",
    "Mohamed Elgharib",
    "Jann-Ole Henningson",
    "Hans-Peter Seidel",
    "Susana Castillo",
    "Christian Theobalt",
    "Marcus Magnor"
  ],
  "abstract": "Video-based human motion transfer creates video animations of humans following a source motion. Current methods show remarkable results for tightly-clad subjects. However, the lack of temporally consistent handling of plausible clothing dynamics, including fine and high-frequency details, significantly limits the attainable visual quality. We address these limitations for the first time in the literature and present a new framework which performs high-fidelity and temporally-consistent human motion transfer with natural pose-dependent non-rigid deformations, for several types of loose garments. In contrast to the previous techniques, we perform image generation in three subsequent stages: synthesizing human shape, structure, and appearance. Given a monocular RGB video of an actor, we train a stack of recurrent deep neural networks that generate these intermediate representations from 2D poses and their temporal derivatives. Splitting the difficult motion transfer problem into subtasks that are aware of the temporal motion context helps us to synthesize results with plausible dynamics and pose-dependent detail. It also allows artistic control of results by manipulation of individual framework stages. In the experimental results, we significantly outperform the state-of-the-art in terms of video realism. The source code is available at https://graphics.tu-bs.de/publications/kappel2020high-fidelity.",
  "s2id": "879705177ae248c76f0896ed8dd10aea07d0bc77",
  "twitter": {
    "retweets": 8,
    "likes": 55,
    "replies": 1,
    "ids": [
      "1341215651986325505",
      "1341972987436666882",
      "1388306860231565317",
      "1379139525948141572",
      "1342878593714708487",
      "1341393475460345856",
      "1341212154993754112"
    ]
  },
  "citations": 1,
  "posterSession": "Monday"
}