{
  "arXiv": "http://arxiv.org/abs/2006.05121",
  "title": "Roses Are Red, Violets Are Blue... but Should VQA Expect Them To?",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Kervadec_Roses_Are_Red_Violets_Are_Blue..._but_Should_VQA_Expect_CVPR_2021_paper.pdf",
  "authors": [
    "Corentin Kervadec",
    "Grigory Antipov",
    "Moez Baccouche",
    "Christian Wolf"
  ],
  "abstract": "Models for Visual Question Answering (VQA) are notorious for their tendency to rely on dataset biases, as the large and unbalanced diversity of questions and concepts involved and tends to prevent models from learning to \"\"reason\"\", leading them to perform \"\"educated guesses\"\" instead. In this paper, we claim that the standard evaluation metric, which consists in measuring the overall in-domain accuracy, is misleading. Since questions and concepts are unbalanced, this tends to favor models which exploit subtle training set statistics. Alternatively, naively introducing artificial distribution shifts between train and test splits is also not completely satisfying. First, the shifts do not reflect real-world tendencies, resulting in unsuitable models; second, since the shifts are handcrafted, trained models are specifically designed for this particular setting, and do not generalize to other configurations. We propose the GQA-OOD benchmark designed to overcome these concerns: we measure and compare accuracy over both rare and frequent question-answer pairs, and argue that the former is better suited to the evaluation of reasoning abilities, which we experimentally validate with models trained to more or less exploit biases. In a large-scale study involving 7 VQA models and 3 bias reduction techniques, we also experimentally demonstrate that these models fail to address questions involving infrequent concepts and provide recommendations for future directions of research.",
  "s2id": "95cb3e6b628a3a0220b8c80fde4f9f4a3d2e7221",
  "twitter": {
    "retweets": 10,
    "likes": 28,
    "replies": 3
  },
  "citations": 7
}