{
  "arXiv": "http://arxiv.org/abs/2006.07502",
  "title": "UniT: Unified Knowledge Transfer for Any-Shot Object Detection and Segmentation",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Khandelwal_UniT_Unified_Knowledge_Transfer_for_Any-Shot_Object_Detection_and_Segmentation_CVPR_2021_paper.pdf",
  "authors": [
    "Siddhesh Khandelwal",
    "Raghav Goyal",
    "Leonid Sigal"
  ],
  "abstract": "Methods for object detection and segmentation rely on large scale instance-level annotations for training, which are difficult and time-consuming to collect. Efforts to alleviate this look at varying degrees and quality of supervision. Weakly-supervised approaches draw on image-level labels to build detectors/segmentors, while zero/few-shot methods assume abundant instance-level data for a set of base classes, and none to a few examples for novel classes. This taxonomy has largely siloed algorithmic designs. In this work, we aim to bridge this divide by proposing an intuitive and unified semi-supervised model that is applicable to a range of supervision: from zero to a few instance-level samples per novel class. For base classes, our model learns a mapping from weakly-supervised to fully-supervised detectors/segmentors. By learning and leveraging visual and lingual similarities between the novel and base classes, we transfer those mappings to obtain detectors/segmentors for novel classes; refining them with a few novel class instance-level annotated samples, if available. The overall model is end-to-end trainable and highly flexible. Through extensive experiments on MS-COCO and Pascal VOC benchmark datasets we show improved performance in a variety of settings.",
  "s2id": "1429ecd688dfe9175f22302de727a9029d7f293a",
  "twitter": {
    "retweets": 1,
    "likes": 1,
    "replies": 1,
    "ids": [
      "1272705714826489857",
      "1272902065556250627",
      "1272787085800476673",
      "1272705401033719809"
    ]
  },
  "citations": 1,
  "posterSession": "Tuesday"
}