{
  "arXiv": "http://arxiv.org/abs/2103.11511",
  "title": "MoViNets: Mobile Video Networks for Efficient Video Recognition",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Kondratyuk_MoViNets_Mobile_Video_Networks_for_Efficient_Video_Recognition_CVPR_2021_paper.pdf",
  "authors": [
    "Dan Kondratyuk",
    "Liangzhe Yuan",
    "Yandong Li",
    "Li Zhang",
    "Mingxing Tan",
    "Matthew Brown",
    "Boqing Gong"
  ],
  "abstract": "We present Mobile Video Networks (MoViNets), a family of computation and memory efficient video networks that can operate on streaming video for online inference. 3D convolutional neural networks (CNNs) are accurate at video recognition but require large computation and memory budgets and do not support online inference, making them difficult to work on mobile devices. We propose a three-step approach to improve computational efficiency while substantially reducing the peak memory usage of 3D CNNs. First, we design a video network search space and employ neural architecture search to generate efficient and diverse 3D CNN architectures. Second, we introduce the Stream Buffer technique that decouples memory from video clip duration, allowing 3D CNNs to embed arbitrary-length streaming video sequences for both training and inference with a small constant memory footprint. Third, we propose a simple ensembling technique to improve accuracy further without sacrificing efficiency. These three progressive techniques allow MoViNets to achieve state-of-the-art accuracy and efficiency on the Kinetics, Moments in Time, and Charades video action recognition datasets. For instance, MoViNet-A5-Stream achieves the same accuracy as X3D-XL on Kinetics 600 while requiring 80% fewer FLOPs and 65% less memory. Code is available at https://github.com/google-research/movinet.",
  "s2id": "0820694e95d1a9bfe364727a5f568f139cf5a980",
  "twitter": {
    "retweets": 26,
    "likes": 130,
    "replies": 4,
    "ids": [
      "1374179285896884231",
      "1374209013710262275",
      "1380105641235111936",
      "1380196240801984513",
      "1374467022319284226",
      "1374179595415662599"
    ]
  },
  "citations": 1,
  "posterSession": "Friday"
}