{
  "arXiv": "http://arxiv.org/abs/2104.11216",
  "title": "Hierarchical Motion Understanding via Motion Programs",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Kulal_Hierarchical_Motion_Understanding_via_Motion_Programs_CVPR_2021_paper.pdf",
  "authors": [
    "Sumith Kulal",
    "Jiayuan Mao",
    "Alex Aiken",
    "Jiajun Wu"
  ],
  "abstract": "Current approaches to video analysis of human motion focus on raw pixels or keypoints as the basic units of reasoning. We posit that adding higher-level motion primitives, which can capture natural coarser units of motion such as backswing or follow-through, can be used to improve downstream analysis tasks. This higher level of abstraction can also capture key features, such as loops of repeated primitives, that are currently inaccessible at lower levels of representation. We therefore introduce Motion Programs, a neuro-symbolic, program-like representation that expresses motions as a composition of high-level primitives. We also present a system for automatically inducing motion programs from videos of human motion and for leveraging motion programs in video synthesis. Experiments show that motion programs can accurately describe a diverse set of human motions and the inferred programs contain semantically meaningful motion primitives, such as arm swings and jumping jacks. Our representation also benefits downstream tasks such as video interpolation and video prediction and outperforms off-the-shelf models. We further demonstrate how these programs can detect diverse kinds of repetitive motion and facilitate interactive video editing.",
  "s2id": "c6d477e223b44f4b0b7c44f973294aa00907cf58",
  "twitter": {
    "retweets": 7,
    "likes": 59,
    "replies": 0,
    "ids": [
      "1385406108014161921",
      "1385671075451654146",
      "1386132976946319362",
      "1386057624420978690",
      "1385936761721958404",
      "1385770687772639233",
      "1385725294833639424",
      "1385589417763557377",
      "1385491088186789888",
      "1385408205883428866"
    ]
  },
  "citations": 0,
  "posterSession": "Tuesday"
}