{
  "arXiv": "http://arxiv.org/abs/2105.08941",
  "title": "Large-Scale Localization Datasets in Crowded Indoor Spaces",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Lee_Large-Scale_Localization_Datasets_in_Crowded_Indoor_Spaces_CVPR_2021_paper.pdf",
  "authors": [
    "Donghwan Lee",
    "Soohyun Ryu",
    "Suyong Yeon",
    "Yonghan Lee",
    "Deokhwa Kim",
    "Cheolho Han",
    "Yohann Cabon",
    "Philippe Weinzaepfel",
    "Nicolas Guerin",
    "Gabriela Csurka",
    "Martin Humenberger"
  ],
  "abstract": "Estimating the precise location of a camera using visual localization enables interesting applications such as augmented reality or robot navigation. This is particularly useful in indoor environments where other localization technologies, such as GNSS, fail. Indoor spaces impose interesting challenges on visual localization algorithms: occlusions due to people, textureless surfaces, large viewpoint changes, low light, repetitive textures, etc. Existing indoor datasets are either comparably small or do only cover a subset of the mentioned challenges. In this paper, we introduce 5 new indoor datasets for visual localization in challenging real-world environments. They were captured in a large shopping mall and a large metro station in Seoul, South Korea, using a dedicated mapping platform consisting of 10 cameras and 2 laser scanners. In order to obtain accurate ground truth camera poses, we developed a robust LiDAR SLAM which provides initial poses that are then refined using a novel structure-from-motion based optimization. We present a benchmark of modern visual localization algorithms on these challenging datasets showing superior performance of structure-based methods using robust image features. The datasets are available at: https://naverlabs.com/datasets",
  "s2id": "2abe258bd0f36d521139def37138f168b03dd8f3",
  "twitter": {
    "retweets": 31,
    "likes": 122,
    "replies": 4,
    "ids": [
      "1395255973862940672",
      "1395187158735114241",
      "1395351705471135744",
      "1396588762855927812",
      "1396664817235202054",
      "1397736315110690817",
      "1397736074554732545",
      "1396665008969420807",
      "1395674754179387392"
    ]
  },
  "citations": 0,
  "posterSession": "Tuesday"
}