{
  "arXiv": "http://arxiv.org/abs/2102.06183",
  "title": "Less Is More: ClipBERT for Video-and-Language Learning via Sparse Sampling",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Lei_Less_Is_More_ClipBERT_for_Video-and-Language_Learning_via_Sparse_Sampling_CVPR_2021_paper.pdf",
  "authors": [
    "Jie Lei",
    "Linjie Li",
    "Luowei Zhou",
    "Zhe Gan",
    "Tamara L. Berg",
    "Mohit Bansal",
    "Jingjing Liu"
  ],
  "abstract": "The canonical approach to video-and-language learning (e.g., video question answering) dictates a neural model to learn from offline-extracted dense video features from vision models and text features from language models. These feature extractors are trained independently and usually on tasks different from the target domains, rendering these fixed features sub-optimal for downstream tasks. Moreover, due to the high computational overload of dense video features, it is often difficult (or infeasible) to plug feature extractors directly into existing approaches for easy finetuning. To provide a remedy to this dilemma, we propose a generic framework CLIPBERT that enables affordable end-to-end learning for video-and-language tasks, by employing sparse sampling, where only a single or a few sparsely sampled short clips from a video are used at each training step. Experiments on text-to-video retrieval and video question answering on six datasets demonstrate that CLIPBERT outperforms (or is on par with) existing methods that exploit full-length videos, suggesting that end-to-end learning with just a few sparsely sampled clips is often more accurate than using densely extracted offline features from full-length videos, proving the proverbial less-is-more principle. Videos in the datasets are from considerably different domains and lengths, ranging from 3-second generic-domain GIF videos to 180-second YouTube human activity videos, showing the generalization ability of our approach. Comprehensive ablation studies and thorough analyses are provided to dissect what factors lead to this success.",
  "s2id": "ba4a4d31d2af23eefadbf19e5efd5a7d4fd89143",
  "twitter": {
    "retweets": 43,
    "likes": 258,
    "replies": 6,
    "ids": [
      "1366460527388618756",
      "1360048161943941123",
      "1374307434496417792",
      "1366616651987357697",
      "1360634217378553856",
      "1374398030800113664",
      "1360243462252027905",
      "1368966239175942144",
      "1360288099549462534",
      "1372823157825019906",
      "1372822901741654017"
    ]
  },
  "citations": 15,
  "posterSession": "Wednesday"
}