{
  "arXiv": "http://arxiv.org/abs/2103.04260",
  "title": "ARVo: Learning All-Range Volumetric Correspondence for Video Deblurring",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Li_ARVo_Learning_All-Range_Volumetric_Correspondence_for_Video_Deblurring_CVPR_2021_paper.pdf",
  "authors": [
    "Dongxu Li",
    "Chenchen Xu",
    "Kaihao Zhang",
    "Xin Yu",
    "Yiran Zhong",
    "Wenqi Ren",
    "Hanna Suominen",
    "Hongdong Li"
  ],
  "abstract": "Video deblurring models exploit consecutive frames to remove blurs from camera shakes and object motions. In order to utilize neighboring sharp patches, typical methods rely mainly on homography or optical flows to spatially align neighboring blurry frames. However, such explicit approaches are less effective in the presence of fast motions with large pixel displacements. In this work, we propose a novel implicit method to learn spatial correspondence among blurry frames in the feature space. To construct distant pixel correspondences, our model builds a correlation volume pyramid among all the pixel-pairs between neighboring frames. To enhance the features of the reference frame, we design a correlative aggregation module that maximizes the pixel-pair correlations with its neighbors based on the volume pyramid. Finally, we feed the aggregated features into a reconstruction module to obtain the restored frame. We design a generative adversarial paradigm to optimize the model progressively. Our proposed method is evaluated on the widely-adopted DVD dataset, along with a newly collected High-Frame-Rate (1000 fps) Dataset for Video Deblurring (HFR-DVD). Quantitative and qualitative experiments show that our model performs favorably on both datasets against previous state-of-the-art methods, confirming the benefit of modeling all-range spatial correspondence for video deblurring.",
  "s2id": "9a93fadaa32bd688d88125c09f143737e252cbfa",
  "twitter": {
    "retweets": 0,
    "likes": 0,
    "replies": 1
  },
  "citations": 5
}