{
  "arXiv": "http://arxiv.org/abs/2103.16391",
  "title": "Causal Hidden Markov Model for Time Series Disease Forecasting",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Li_Causal_Hidden_Markov_Model_for_Time_Series_Disease_Forecasting_CVPR_2021_paper.pdf",
  "authors": [
    "Jing Li",
    "Botong Wu",
    "Xinwei Sun",
    "Yizhou Wang"
  ],
  "abstract": "We propose a causal hidden Markov model to achieve robust prediction of irreversible disease at an early stage, which is safety-critical and vital for medical treatment in early stages. Specifically, we introduce the hidden variables which propagate to generate medical data at each time step. To avoid learning spurious correlation (e.g., confounding bias), we explicitly separate these hidden variables into three parts: a) the disease (clinical)-related part; b) the disease (non-clinical)-related part; c) others, with only a),b) causally related to the disease however c) may contain spurious correlations (with the disease) inherited from the data provided. With personal attributes and disease label respectively provided as side information and supervision, we prove that these disease-related hidden variables can be disentangled from others, implying the avoidance of spurious correlation for generalization to medical data from other (out-of-) distributions. Guaranteed by this result, we propose a sequential variational auto-encoder with a reformulated objective function. We apply our model to the early prediction of peripapillary atrophy and achieve promising results on out-of-distribution test data. Further, the ablation study empirically shows the effectiveness of each component in our method. And the visualization shows the accurate identification of lesion regions from others.",
  "s2id": "3b06f586c29628648a9712d519cb0505769b8b76",
  "twitter": {
    "retweets": 0,
    "likes": 1,
    "replies": 0,
    "ids": [
      "1380360969973456898",
      "1377390375581544450",
      "1377239539358519296",
      "1377179248729845760",
      "1377103796506042376",
      "1377073481989390337"
    ]
  },
  "citations": 0,
  "posterSession": "Thursday"
}