{
  "arXiv": "http://arxiv.org/abs/2011.12885",
  "title": "Generalized Focal Loss V2: Learning Reliable Localization Quality Estimation for Dense Object Detection",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Li_Generalized_Focal_Loss_V2_Learning_Reliable_Localization_Quality_Estimation_for_CVPR_2021_paper.pdf",
  "authors": [
    "Xiang Li",
    "Wenhai Wang",
    "Xiaolin Hu",
    "Jun Li",
    "Jinhui Tang",
    "Jian Yang"
  ],
  "abstract": "Localization Quality Estimation (LQE) is crucial and popular in the recent advancement of dense object detectors since it can provide accurate ranking scores that benefit the Non-Maximum Suppression processing and improve detection performance. As a common practice, most existing methods predict LQE scores through vanilla convolutional features shared with object classification or bounding box regression. In this paper, we explore a completely novel and different perspective to perform LQE -- based on the learned distributions of the four parameters of the bounding box. The bounding box distributions are inspired and introduced as \"General Distribution\" in GFLV1, which describes the uncertainty of the predicted bounding boxes well. Such a property makes the distribution statistics of a bounding box highly correlated to its real localization quality. Specifically, a bounding box distribution with a sharp peak usually corresponds to high localization quality, and vice versa. By leveraging the close correlation between distribution statistics and the real localization quality, we develop a considerably lightweight Distribution-Guided Quality Predictor (DGQP) for reliable LQE based on GFLV1, thus producing GFLV2. To our best knowledge, it is the first attempt in object detection to use a highly relevant, statistical representation to facilitate LQE. Extensive experiments demonstrate the effectiveness of our method. Notably, GFLV2 (ResNet-101) achieves 46.2 AP at 14.6 FPS, surpassing the previous state-of-the-art ATSS baseline (43.6 AP at 14.6 FPS) by absolute 2.6 AP on COCO  \\tt test-dev , without sacrificing the efficiency both in training and inference.",
  "s2id": "cd9a2b4578fbd812fea5d31e5b8e778f13e352c0",
  "twitter": {
    "retweets": 7,
    "likes": 42,
    "replies": 0,
    "ids": [
      "1332239266307395584"
    ]
  },
  "citations": 5,
  "posterSession": "Thursday"
}