{
  "arXiv": "http://arxiv.org/abs/2012.00596",
  "title": "NPAS: A Compiler-Aware Framework of Unified Network Pruning and Architecture Search for Beyond Real-Time Mobile Acceleration",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Li_NPAS_A_Compiler-Aware_Framework_of_Unified_Network_Pruning_and_Architecture_CVPR_2021_paper.pdf",
  "authors": [
    "Zhengang Li",
    "Geng Yuan",
    "Wei Niu",
    "Pu Zhao",
    "Yanyu Li",
    "Yuxuan Cai",
    "Xuan Shen",
    "Zheng Zhan",
    "Zhenglun Kong",
    "Qing Jin",
    "Zhiyu Chen",
    "Sijia Liu",
    "Kaiyuan Yang",
    "Bin Ren",
    "Yanzhi Wang",
    "Xue Lin"
  ],
  "abstract": "With the increasing demand to efficiently deploy DNNs on mobile edge devices, it becomes much more important to reduce unnecessary computation and increase the execution speed. Prior methods towards this goal, including model compression and network architecture search (NAS), are largely performed independently, and do not fully consider compiler-level optimizations which is a must-do for mobile acceleration. In this work, we first propose (i) a general category of fine-grained structured pruning applicable to various DNN layers, and (ii) a comprehensive, compiler automatic code generation framework supporting different DNNs and different pruning schemes, which bridge the gap of model compression and NAS. We further propose NPAS, a compiler-aware unified network pruning and architecture search. To deal with large search space, we propose a meta-modeling procedure based on reinforcement learning with fast evaluation and Bayesian optimization, ensuring the total number of training epochs comparable with representative NAS frameworks. Our framework achieves 6.7ms, 5.9ms, and 3.9ms ImageNet inference times with 78.2%, 75% (MobileNet-V3 level), and 71% (MobileNet-V2 level) Top-1 accuracy respectively on an off-the-shelf mobile phone, consistently outperforming prior work.",
  "s2id": "",
  "twitter": {
    "retweets": 10,
    "likes": 46,
    "replies": 1
  },
  "posterSession": "Thursday"
}