{
  "arXiv": "http://arxiv.org/abs/2103.06564",
  "title": "PointFlow: Flowing Semantics Through Points for Aerial Image Segmentation",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Li_PointFlow_Flowing_Semantics_Through_Points_for_Aerial_Image_Segmentation_CVPR_2021_paper.pdf",
  "authors": [
    "Xiangtai Li",
    "Hao He",
    "Xia Li",
    "Duo Li",
    "Guangliang Cheng",
    "Jianping Shi",
    "Lubin Weng",
    "Yunhai Tong",
    "Zhouchen Lin"
  ],
  "abstract": "Aerial Image Segmentation is a particular semantic segmentation problem and has several challenging characteristics that general semantic segmentation does not have. There are two critical issues: The one is an extremely foreground-background imbalanced distribution and the other is multiple small objects along with complex background. Such problems make the recent dense affinity context modeling perform poorly even compared with baselines due to over-introduced background context. To handle these problems, we propose a point-wise affinity propagation module based on the FPN framework, named PointFlow. Rather than dense affinity learning, a sparse affinity map is generated upon selected points between the adjacent features, which reduces the noise introduced by the background while keeping efficiency. In particular, we design a dual point matcher to select points from the salient area and object boundaries, respectively. The former samples salient points while the latter samples points from the object boundaries. Experimental results on three different aerial segmentation datasets suggest that the proposed method is more effective and efficient than state-of-the-art general semantic segmentation methods. Especially, our methods achieve the best speed and accuracy trade-off on three aerial benchmarks. Further experiments on three general semantic segmentation datasets prove the generality of our method. Both code and models will be available for further research.",
  "s2id": "ba04bfa1ee12acb2fda47bbf537b3bb0b6478590",
  "twitter": {
    "retweets": 0,
    "likes": 0,
    "replies": 1
  },
  "citations": 1
}