{
  "arXiv": "http://arxiv.org/abs/2103.16050",
  "title": "Progressive Domain Expansion Network for Single Domain Generalization",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Li_Progressive_Domain_Expansion_Network_for_Single_Domain_Generalization_CVPR_2021_paper.pdf",
  "authors": [
    "Lei Li",
    "Ke Gao",
    "Juan Cao",
    "Ziyao Huang",
    "Yepeng Weng",
    "Xiaoyue Mi",
    "Zhengze Yu",
    "Xiaoya Li",
    "Boyang Xia"
  ],
  "abstract": "Single domain generalization is a challenging case of model generalization, where the models are trained on a single domain and tested on other unseen domains. A promising solution is to learn cross-domain invariant representations by expanding the coverage of the training domain. These methods have limited generalization performance gains in practical applications due to the lack of appropriate safety and effectiveness constraints. In this paper, we propose a novel learning framework called progressive domain expansion network (PDEN) for single domain generalization. The domain expansion subnetwork and representation learning subnetwork in PDEN mutually benefit from each other by joint learning. For the domain expansion subnetwork, multiple domains are progressively generated in order to simulate various photometric and geometric transforms in unseen domains. A series of strategies are introduced to guarantee the safety and effectiveness of the expanded domains. For the domain invariant representation learning subnetwork, contrastive learning is introduced to learn the domain invariant representation in which each class is well clustered so that a better decision boundary can be learned to improve it's generalization. Extensive experiments on classification and segmentation have shown that PDEN can achieve up to 15.28% improvement compared with the state-of-the-art single-domain generalization methods.",
  "s2id": "6ab82d3abe6c1b09ca9695f901ed927a0171a875",
  "twitter": {
    "retweets": 0,
    "likes": 0,
    "replies": 1,
    "ids": [
      "1378203378241695744",
      "1377345124686913538",
      "1377254657848922112",
      "1377148774234030085",
      "1377103700649385987",
      "1377073431313854468"
    ]
  },
  "citations": 1,
  "posterSession": "Monday"
}