{
  "arXiv": "http://arxiv.org/abs/2103.02927",
  "title": "QAIR: Practical Query-Efficient Black-Box Attacks for Image Retrieval",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Li_QAIR_Practical_Query-Efficient_Black-Box_Attacks_for_Image_Retrieval_CVPR_2021_paper.pdf",
  "authors": [
    "Xiaodan Li",
    "Jinfeng Li",
    "Yuefeng Chen",
    "Shaokai Ye",
    "Yuan He",
    "Shuhui Wang",
    "Hang Su",
    "Hui Xue"
  ],
  "abstract": "We study the query-based attack against image retrieval to evaluate its robustness against adversarial examples under the black-box setting, where the adversary only has query access to the top-k ranked unlabeled images from the database. Compared with query attacks in image classification, which produce adversaries according to the returned labels or confidence score, the challenge becomes even more prominent due to the difficulty in quantifying the attack effectiveness on the partial retrieved list. In this paper, we make the first attempt in Query-based Attack against Image Retrieval (QAIR), to completely subvert the top-k retrieval results. Specifically, a new relevance-based loss is designed to quantify the attack effects by measuring the set similarity on the top-k retrieval results before and after attacks and guide the gradient optimization. To further boost the attack efficiency, a recursive model stealing method is proposed to acquire transferable priors on the target model and generate the prior-guided gradients. Comprehensive experiments show that the proposed attack achieves a high attack success rate with few queries against the image retrieval systems under the black-box setting. The attack evaluations on real-world visual search engine show that it successfully deceives a commercial system such as Bing Visual Search with 98% attack success rate by only 33 queries on average.",
  "s2id": "446b07b8aaaaa75f0352be89bd97498ee5f69e36",
  "twitter": {
    "retweets": 0,
    "likes": 0,
    "replies": 1,
    "ids": [
      "1367732241950932994"
    ]
  },
  "citations": 2,
  "posterSession": "Tuesday"
}