{
  "arXiv": "http://arxiv.org/abs/2103.03243",
  "title": "Anycost GANs for Interactive Image Synthesis and Editing",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Lin_Anycost_GANs_for_Interactive_Image_Synthesis_and_Editing_CVPR_2021_paper.pdf",
  "authors": [
    "Ji Lin",
    "Richard Zhang",
    "Frieder Ganz",
    "Song Han",
    "Jun-Yan Zhu"
  ],
  "abstract": "Generative adversarial networks (GANs) have enabled photorealistic image synthesis and editing. However, due to the high computational cost of large-scale generators (e.g., StyleGAN2), it usually takes seconds to see the results of a single edit on edge devices, prohibiting interactive user experience. In this paper, inspired by quick preview features in modern rendering software, we propose Anycost GAN for interactive natural image editing. We train the Anycost GAN to support elastic resolutions and channels for faster image generation at versatile speeds. Running subsets of the full generator produce outputs that are perceptually similar to the full generator, making them a good proxy for a quick preview. By using sampling-based multi-resolution training, adaptive-channel training, and a generator-conditioned discriminator, the anycost generator can be evaluated at various configurations while achieving better image quality compared to separately trained models. Furthermore, we develop new encoder training and latent code optimization techniques to encourage consistency between the different sub-generators during image projection. Anycost GAN can be executed at various cost budgets (up to 10x computation reduction) and adapt to a wide range of hardware and latency requirements. When deployed on desktop CPUs and edge devices, our model can provide perceptually similar previews at 6-12x speedup, enabling interactive image editing. The code and demo are publicly available.",
  "s2id": "43d9627fdf1436d827788cd95105112a57b53696",
  "twitter": {
    "retweets": 41,
    "likes": 160,
    "replies": 6,
    "ids": [
      "1367662344667545600",
      "1368331441545768962",
      "1368989019825086466",
      "1368518901928062980",
      "1369248740280778754",
      "1373394210905325577",
      "1367736671517765634",
      "1372544568365772810",
      "1367755012156317696",
      "1379779746268131330",
      "1379779490482544647",
      "1371054503328239617",
      "1370329484201754625",
      "1368071244197806085",
      "1367731660339302400"
    ]
  },
  "citations": 2,
  "posterSession": "Thursday"
}