{
  "arXiv": "http://arxiv.org/abs/2004.04690",
  "title": "Orthogonal Over-Parameterized Training",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Liu_Orthogonal_Over-Parameterized_Training_CVPR_2021_paper.pdf",
  "authors": [
    "Weiyang Liu",
    "Rongmei Lin",
    "Zhen Liu",
    "James M. Rehg",
    "Liam Paull",
    "Li Xiong",
    "Le Song",
    "Adrian Weller"
  ],
  "abstract": "The inductive bias of a neural network is largely determined by the architecture and the training algorithm. To achieve good generalization, how to effectively train a neural network is of great importance. We propose a novel orthogonal over-parameterized training (OPT) framework that can provably minimize the hyperspherical energy which characterizes the diversity of neurons on a hypersphere. By maintaining the minimum hyperspherical energy during training, OPT can greatly improve the empirical generalization. Specifically, OPT fixes the randomly initialized weights of the neurons and learns an orthogonal transformation that applies to these neurons. We consider multiple ways to learn such an orthogonal transformation, including unrolling orthogonalization algorithms, applying orthogonal parameterization, and designing orthogonality-preserving gradient descent. For better scalability, we propose the stochastic OPT which performs orthogonal transformation stochastically for partial dimensions of neurons. Interestingly, OPT reveals that learning a proper coordinate system for neurons is crucial to generalization. We provide some insights on why OPT yields better generalization. Extensive experiments validate the superiority of OPT over the standard training.",
  "s2id": "5baf279719b42ba53d931f4f7c03af8aef7c325b",
  "twitter": {
    "retweets": 6,
    "likes": 16,
    "replies": 3,
    "ids": [
      "1248479365890838531",
      "1248888547983020032",
      "1285540363709698049",
      "1402078026586808321",
      "1248440694705926144",
      "1248446390847418370",
      "1402259496525778951",
      "1249195832248844290",
      "1248428535707922434",
      "1248431318532157444",
      "1248448804182822912",
      "1248621917939978241",
      "1248637185269682176",
      "1248833381015715841",
      "1249014628325249025",
      "1272339757603815424",
      "1249391922847907842",
      "1272343376130695170",
      "1272539674146373635",
      "1285389421613920257",
      "1285721639913754625",
      "1285750869321908224",
      "1377156125737381889",
      "1377254782025539593",
      "1377275029876957184",
      "1377345268580970496",
      "1377450865133551621",
      "1377632250767024128",
      "1248410502704664576"
    ]
  },
  "citations": 7,
  "posterSession": "Wednesday"
}