{
  "arXiv": "http://arxiv.org/abs/2010.05063",
  "title": "Adaptive Aggregation Networks for Class-Incremental Learning",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Liu_Adaptive_Aggregation_Networks_for_Class-Incremental_Learning_CVPR_2021_paper.pdf",
  "authors": [
    "Yaoyao Liu",
    "Bernt Schiele",
    "Qianru Sun"
  ],
  "abstract": "Class-Incremental Learning (CIL) aims to learn a classification model with the number of classes increasing phase-by-phase. An inherent problem in CIL is the stability-plasticity dilemma between the learning of old and new classes, i.e., high-plasticity models easily forget old classes, but high-stability models are weak to learn new classes. We alleviate this issue by proposing a novel network architecture called Adaptive Aggregation Networks (AANets), in which we explicitly build two types of residual blocks at each residual level (taking ResNet as the baseline architecture): a stable block and a plastic block. We aggregate the output feature maps from these two blocks and then feed the results to the next-level blocks. We adapt the aggregation weights in order to balance these two types of blocks, i.e., to balance stability and plasticity, dynamically. We conduct extensive experiments on three CIL benchmarks: CIFAR-100, ImageNet-Subset, and ImageNet, and show that many existing CIL methods can be straightforwardly incorporated into the architecture of AANets to boost their performances.",
  "s2id": "",
  "twitter": {
    "retweets": 1,
    "likes": 9,
    "replies": 2,
    "ids": [
      "1377076711364378635",
      "1315922066533748739",
      "1390649982898876417",
      "1339418664437735424",
      "1316056423789481985",
      "1390650124787982336",
      "1390649621307920385",
      "1390648111765282818",
      "1316026228751568911",
      "1315911263424335874",
      "1315875011022991360",
      "1315846384021504001",
      "1315833210727784449",
      "1315829756731035649"
    ]
  },
  "posterSession": "Monday"
}