{
  "arXiv": "http://arxiv.org/abs/2012.15175",
  "title": "Rethinking the Heatmap Regression for Bottom-Up Human Pose Estimation",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Luo_Rethinking_the_Heatmap_Regression_for_Bottom-Up_Human_Pose_Estimation_CVPR_2021_paper.pdf",
  "authors": [
    "Zhengxiong Luo",
    "Zhicheng Wang",
    "Yan Huang",
    "Liang Wang",
    "Tieniu Tan",
    "Erjin Zhou"
  ],
  "abstract": "Heatmap regression has become the most prevalent choice for nowadays human pose estimation methods. The ground-truth heatmaps are usually constructed by covering all skeletal keypoints by 2D gaussian kernels. The standard deviations of these kernels are fixed. However, for bottom-up methods, which need to handle a large variance of human scales and labeling ambiguities, the current practice seems unreasonable. To better cope with these problems, we propose the scale-adaptive heatmap regression (SAHR) method, which can adaptively adjust the standard deviation for each keypoint. In this way, SAHR is more tolerant of various human scales and labeling ambiguities. However, SAHR may aggravate the imbalance between fore-background samples, which potentially hurts the improvement of SAHR. Thus, we further introduce the weight-adaptive heatmap regression (WAHR) to help balance the fore-background samples. Extensive experiments show that SAHR together with WAHR largely improves the accuracy of bottom-up human pose estimation. As a result, we finally outperform the state-of-the-art model by +1.5AP and achieve 72.0 AP on COCO test-dev2017, which is comparable with the performances of most top-down methods. Source codes are available at https://github.com/greatlog/SWAHR-HumanPose.",
  "s2id": "1e1d697d5d00c77b010c2eb5b90e0e5d773bf3f2",
  "twitter": {
    "retweets": 7,
    "likes": 11,
    "replies": 0,
    "ids": [
      "1346262803003281409",
      "1346919634356719618",
      "1375291785098919944",
      "1375261488286474245",
      "1344835849360433152",
      "1375835191437107200",
      "1375442747751071747",
      "1375518218094137344",
      "1375638958542090245",
      "1370037160271831040",
      "1369840797647011842",
      "1376016432916488194",
      "1346829184589570058",
      "1346647821232037889",
      "1345772210473099265",
      "1345575966349922304",
      "1345379682632544256",
      "1345334379346706433",
      "1345198414217228288",
      "1345017219240099841",
      "1376197707006611460"
    ]
  },
  "citations": 1,
  "posterSession": "Thursday"
}