{
  "arXiv": "http://arxiv.org/abs/2104.07660",
  "title": "SCALE: Modeling Clothed Humans with a Surface Codec of Articulated Local Elements",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Ma_SCALE_Modeling_Clothed_Humans_with_a_Surface_Codec_of_Articulated_CVPR_2021_paper.pdf",
  "authors": [
    "Qianli Ma",
    "Shunsuke Saito",
    "Jinlong Yang",
    "Siyu Tang",
    "Michael J. Black"
  ],
  "abstract": "Learning to model and reconstruct humans in clothing is challenging due to articulation, non-rigid deformation, and varying clothing types and topologies. To enable learning, the choice of representation is the key. Recent work uses neural networks to parameterize local surface elements. This approach captures locally coherent geometry and non-planar details, can deal with varying topology, and does not require registered training data. However, naively using such methods to model 3D clothed humans fails to capture fine-grained local deformations and generalizes poorly. To address this, we present three key innovations: First, we deform surface elements based on a human body model such that large-scale deformations caused by articulation are explicitly separated from topological changes and local clothing deformations. Second, we address the limitations of existing neural surface elements by regressing local geometry from local features, significantly improving the expressiveness. Third, we learn a pose embedding on a 2D parameterization space that encodes posed body geometry, improving generalization to unseen poses by reducing non-local spurious correlations. We demonstrate the efficacy of our surface representation by learning models of complex clothing from point clouds. The clothing can change topology and deviate from the topology of the body. Once learned, we can animate previously unseen motions, producing high-quality point clouds, from which we generate realistic images with neural rendering. We assess the importance of each technical contribution and show that our approach outperforms the state-of-the-art methods in terms of reconstruction accuracy and inference time. The code is available for research purposes at https://qianlim.github.io/SCALE.",
  "s2id": "536eed27be9162436358f1e55e4fd9931037cdf2",
  "twitter": {
    "retweets": 17,
    "likes": 63,
    "replies": 0,
    "ids": [
      "1382882354549645313",
      "1383073699205509123"
    ]
  },
  "citations": 4,
  "posterSession": "Friday"
}