{
  "arXiv": "http://arxiv.org/abs/2007.15036",
  "title": "Generative Classifiers as a Basis for Trustworthy Image Classification",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Mackowiak_Generative_Classifiers_as_a_Basis_for_Trustworthy_Image_Classification_CVPR_2021_paper.pdf",
  "authors": [
    "Radek Mackowiak",
    "Lynton Ardizzone",
    "Ullrich Kothe",
    "Carsten Rother"
  ],
  "abstract": "With the maturing of deep learning systems, trustworthiness is becoming increasingly important for model assessment. We understand trustworthiness as the combination of explainability and robustness. Generative classifiers (GCs) are a promising class of models that are said to naturally accomplish these qualities. However, this has mostly been demonstrated on simple datasets such as MNIST and CIFAR in the past. In this work, we firstly develop an architecture and training scheme that allows GCs to operate on a more relevant level of complexity for practical computer vision, namely the ImageNet challenge. Secondly, we demonstrate the immense potential of GCs for trustworthy image classification. Explainability and some aspects of robustness are vastly improved compared to feed-forward models, even when the GCs are just applied naively. While not all trustworthiness problems are solved completely, we observe that GCs are a highly promising basis for further algorithms and modifications. We release our trained model for download in the hope that it serves as a starting point for other generative classification tasks, in much the same way as pretrained ResNet architectures do for discriminative classification.",
  "s2id": "3f4fcc0bdd2a978a45d97183c04c00429330a9c5",
  "twitter": {
    "retweets": 24,
    "likes": 32,
    "replies": 1,
    "ids": [
      "1334541476798353408",
      "1289312287501635584",
      "1290024916100812801",
      "1289201045067849730",
      "1289994499498770432",
      "1289456942507679744",
      "1289020099781943296",
      "1289109367762157569",
      "1289163964488671234",
      "1289219803152920582",
      "1289248223119282177",
      "1289314986276290560",
      "1289360273980104706",
      "1289541537294979072",
      "1334522960196079623",
      "1289571687210668034",
      "1289602034283376640",
      "1289798211348045824",
      "1289813256958357505",
      "1289843704006680576",
      "1296945205942390787",
      "1319458891634298880",
      "1334326871765504000",
      "1289013060947124225"
    ]
  },
  "citations": 2,
  "posterSession": "Tuesday"
}