{
  "arXiv": "http://arxiv.org/abs/2012.01274",
  "title": "How Robust Are Randomized Smoothing Based Defenses to Data Poisoning?",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Mehra_How_Robust_Are_Randomized_Smoothing_Based_Defenses_to_Data_Poisoning_CVPR_2021_paper.pdf",
  "authors": [
    "Akshay Mehra",
    "Bhavya Kailkhura",
    "Pin-Yu Chen",
    "Jihun Hamm"
  ],
  "abstract": "Predictions of certifiably robust classifiers remain constant in a neighborhood of a point, making them resilient to test-time attacks with a guarantee. In this work, we present a previously unrecognized threat to robust machine learning models that highlights the importance of training-data quality in achieving high certified adversarial robustness. Specifically, we propose a novel bilevel optimization-based data poisoning attack that degrades the robustness guarantees of certifiably robust classifiers. Unlike other poisoning attacks that reduce the accuracy of the poisoned models on a small set of target points, our attack reduces the average certified radius (ACR) of an entire target class in the dataset. Moreover, our attack is effective even when the victim trains the models from scratch using state-of-the-art robust training methods such as Gaussian data augmentation [??], MACER [??], and SmoothAdv [??] that achieve high certified adversarial robustness. To make the attack harder to detect, we use clean-label poisoning points with imperceptible distortions. The effectiveness of the proposed method is evaluated by poisoning MNIST and CIFAR10 datasets and training deep neural networks using previously mentioned training methods and certifying the robustness with randomized smoothing. The ACR of the target class, for models trained on generated poison data, can be reduced by more than 30%. Moreover, the poisoned data is transferable to models trained with different training methods and models with different architectures.",
  "s2id": "",
  "twitter": {
    "retweets": 4,
    "likes": 21,
    "replies": 0,
    "ids": [
      "1379114746725728259",
      "1379453340690612228",
      "1385220680921362432"
    ]
  },
  "posterSession": "Thursday"
}