{
  "arXiv": "http://arxiv.org/abs/1911.02088",
  "title": "An Alternative Probabilistic Interpretation of the Huber Loss",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Meyer_An_Alternative_Probabilistic_Interpretation_of_the_Huber_Loss_CVPR_2021_paper.pdf",
  "authors": [
    "Gregory P. Meyer"
  ],
  "abstract": "The Huber loss is a robust loss function used for a wide range of regression tasks. To utilize the Huber loss, a parameter that controls the transitions from a quadratic function to an absolute value function needs to be selected. We believe the standard probabilistic interpretation that relates the Huber loss to the Huber density fails to provide adequate intuition for identifying the transition point. As a result, a hyper-parameter search is often necessary to determine an appropriate value. In this work, we propose an alternative probabilistic interpretation of the Huber loss, which relates minimizing the loss to minimizing an upper-bound on the Kullback-Leibler divergence between Laplace distributions, where one distribution represents the noise in the ground-truth and the other represents the noise in the prediction. In addition, we show that the parameters of the Laplace distributions are directly related to the transition point of the Huber loss. We demonstrate, through a toy problem, that the optimal transition point of the Huber loss is closely related to the distribution of the noise in the ground-truth data. As a result, our interpretation provides an intuitive way to identify well-suited hyper-parameters by approximating the amount of noise in the data, which we demonstrate through a case study and experimentation on the Faster R-CNN and RetinaNet object detectors.",
  "s2id": "327b155ab8e0c065f9f51e7f12ecc28bd68efdc1",
  "twitter": {
    "retweets": 4,
    "likes": 20,
    "replies": 3,
    "ids": [
      "1192259178175303681",
      "1329615609114529792",
      "1329797443958042624",
      "1192595903837683712",
      "1330627358336933888",
      "1329978187875373056",
      "1329993049435480065",
      "1192270511264407553",
      "1192272848926232577",
      "1192273808985657344",
      "1192277394524168192",
      "1192278411277787138",
      "1192432048667017218",
      "1192451750348898304",
      "1330370705461039106",
      "1192616127781691392",
      "1192712213032624129",
      "1330566854646050816",
      "1253204576917876737",
      "1253317852121239552",
      "1253333122684313601",
      "1330174357012963330",
      "1253121531644960768"
    ]
  },
  "citations": 14,
  "posterSession": "Tuesday"
}