{
  "arXiv": "http://arxiv.org/abs/2105.14021",
  "title": "Boosting Monocular Depth Estimation Models to High-Resolution via Content-Adaptive Multi-Resolution Merging",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Miangoleh_Boosting_Monocular_Depth_Estimation_Models_to_High-Resolution_via_Content-Adaptive_Multi-Resolution_CVPR_2021_paper.pdf",
  "authors": [
    "S. Mahdi H. Miangoleh",
    "Sebastian Dille",
    "Long Mai",
    "Sylvain Paris",
    "Yagiz Aksoy"
  ],
  "abstract": "Neural networks have shown great abilities in estimating depth from a single image. However, the inferred depth maps are well below one-megapixel resolution and often lack fine-grained details, which limits their practicality. Our method builds on our analysis on how the input resolution and the scene structure affects depth estimation performance. We demonstrate that there is a trade-off between a consistent scene structure and the high-frequency details, and merge low- and high-resolution estimations to take advantage of this duality using a simple depth merging network. We present a double estimation method that improves the whole-image depth estimation and a patch selection method that adds local details to the final result. We demonstrate that by merging estimations at different resolutions with changing context, we can generate multi-megapixel depth maps with a high level of detail using a pre-trained model.",
  "s2id": "88f868de54c7207368006fe056ebe4713c9fb33d",
  "twitter": {
    "retweets": 148,
    "likes": 690,
    "replies": 5,
    "ids": [
      "1399219089860612096",
      "1401776458704457742",
      "1400451120502165520",
      "1402623026974265352",
      "1402272177689354243",
      "1401842127450038273",
      "1401479742944075777",
      "1401117343200251904",
      "1400754963106746370",
      "1400392831689236481",
      "1400030185190215681",
      "1399485850522685440",
      "1399427283136438278"
    ]
  },
  "citations": 0,
  "posterSession": "Wednesday"
}