{
  "arXiv": "http://arxiv.org/abs/2103.16553",
  "title": "Thinking Fast and Slow: Efficient Text-to-Visual Retrieval With Transformers",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Miech_Thinking_Fast_and_Slow_Efficient_Text-to-Visual_Retrieval_With_Transformers_CVPR_2021_paper.pdf",
  "authors": [
    "Antoine Miech",
    "Jean-Baptiste Alayrac",
    "Ivan Laptev",
    "Josef Sivic",
    "Andrew Zisserman"
  ],
  "abstract": "Our objective is language-based search of large-scale image and video datasets. For this task, the approach that consists of independently mapping text and vision to a joint embedding space, a.k.a. dual encoders, is attractive as retrieval scales and is efficient for billions of images using approximate nearest neighbour search. An alternative approach of using vision-text transformers with cross-attention gives considerable improvements in accuracy over the joint embeddings, but is often inapplicable in practice for large-scale retrieval given the cost of the cross-attention mechanisms required for each sample at test time. This work combines the best of both worlds. We make the following three contributions. First, we equip transformer-based models with a new fine-grained cross-attention architecture, providing significant improvements in retrieval accuracy whilst preserving scalability. Second, we introduce a generic approach for combining a Fast dual encoder model with our Slow but accurate transformer-based model via distillation and re-ranking. Finally, we validate our approach on the Flickr30K image dataset where we show an increase in inference speed by several orders of magnitude while having results competitive to the state of the art. We also extend our method to the video domain, improving the state of the art on the VATEX dataset.",
  "s2id": "983d2b3ef5dca83338907da73983b41a5c6adc7c",
  "twitter": {
    "retweets": 14,
    "likes": 57,
    "replies": 1,
    "ids": [
      "1377063036561850370",
      "1378393114906267650",
      "1378202523362807829"
    ]
  },
  "citations": 1,
  "posterSession": "Wednesday"
}