{
  "arXiv": "http://arxiv.org/abs/2103.02758",
  "title": "Learning Asynchronous and Sparse Human-Object Interaction in Videos",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Morais_Learning_Asynchronous_and_Sparse_Human-Object_Interaction_in_Videos_CVPR_2021_paper.pdf",
  "authors": [
    "Romero Morais",
    "Vuong Le",
    "Svetha Venkatesh",
    "Truyen Tran"
  ],
  "abstract": "Human activities can be learned from video. With effective modeling it is possible to discover not only the action labels but also the temporal structure of the activities, such as the progression of the sub-activities. Automatically recognizing such structure from raw video signal is a new capability that promises authentic modeling and successful recognition of human-object interactions. Toward this goal, we introduce Asynchronous-Sparse Interaction Graph Networks (ASSIGN), a recurrent graph network that is able to automatically detect the structure of interaction events associated with entities in a video scene. ASSIGN pioneers learning of autonomous behavior of video entities including their dynamic structure and their interaction with the coexisting neighbors. Entities' lives in our model are asynchronous to those of others therefore more flexible in adapting to complex scenarios. Their interactions are sparse in time hence more faithful to the true underlying nature and more robust in inference and learning. ASSIGN is tested on human-object interaction recognition and shows superior performance in segmenting and labeling of human sub-activities and object affordances from raw videos. The native ability of ASSIGN in discovering temporal structure also eliminates the dependence on external segmentation that was previously mandatory for this task.",
  "s2id": "d29bbde7fb7f367bc5b06c407f2cf0bfaad6146d",
  "twitter": {
    "retweets": 3,
    "likes": 8,
    "replies": 1,
    "ids": [
      "1371257371637342215",
      "1368071543583080448"
    ]
  },
  "citations": 0,
  "posterSession": "Friday"
}