{
  "arXiv": "http://arxiv.org/abs/2104.03176",
  "title": "On Self-Contact and Human Pose",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Muller_On_Self-Contact_and_Human_Pose_CVPR_2021_paper.pdf",
  "authors": [
    "Lea Muller",
    "Ahmed A. A. Osman",
    "Siyu Tang",
    "Chun-Hao P. Huang",
    "Michael J. Black"
  ],
  "abstract": "People touch their face 23 times an hour, they cross their arms and legs, put their hands on their hips, etc. While many images of people contain some form of self-contact, current 3D human pose and shape (HPS) regression methods typically fail to estimate this contact. To address this, we develop new datasets and methods that significantly improve human pose estimation with self-contact. First, we create a dataset of 3D Contact Poses (3DCP) containing SMPL-X bodies fit to 3D scans as well as poses from AMASS, which we refine to ensure good contact. Second, we leverage this to create the Mimic-The-Pose (MTP) dataset of images, collected via Amazon Mechanical Turk, containing people mimicking the 3DCP poses with self-contact. Third, we develop a novel HPS optimization method, SMPLify-XMC, that includes contact constraints and uses the known 3DCP body pose during fitting to create near ground-truth poses for MTP images. Fourth, for more image variety, we label a dataset of in-the-wild images with Discrete Self-Contact (DSC) information and use another new optimization method, SMPLify-DC, that exploits discrete contacts during pose optimization. Finally, we use our datasets during SPIN training to learn a new 3D human pose regressor, called TUCH (Towards Understanding Contact in Humans). We show that the new self-contact training data significantly improves 3D human pose estimates on withheld test data and existing datasets like 3DPW. Not only does our method improve results for self-contact poses, but it also improves accuracy for non-contact poses. The code and data are available for research purposes at https://tuch.is.tue.mpg.de.",
  "s2id": "05a066cc2b041c1176a755b1b2e16f16ec4553a7",
  "twitter": {
    "retweets": 16,
    "likes": 160,
    "replies": 5,
    "ids": [
      "1380099716571136000",
      "1380016782757523457",
      "1366344425249660931",
      "1380700458893856770"
    ]
  },
  "citations": 2,
  "posterSession": "Wednesday"
}