{
  "arXiv": "http://arxiv.org/abs/2012.04462",
  "title": "Multi-Objective Interpolation Training for Robustness To Label Noise",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Ortego_Multi-Objective_Interpolation_Training_for_Robustness_To_Label_Noise_CVPR_2021_paper.pdf",
  "authors": [
    "Diego Ortego",
    "Eric Arazo",
    "Paul Albert",
    "Noel E. O'Connor",
    "Kevin McGuinness"
  ],
  "abstract": "Deep neural networks trained with standard cross-entropy loss memorize noisy labels, which degrades their performance. Most research to mitigate this memorization proposes new robust classification loss functions. Conversely, we propose a Multi-Objective Interpolation Training (MOIT) approach that jointly exploits contrastive learning and classification to mutually help each other and boost performance against label noise. We show that standard supervised contrastive learning degrades in the presence of label noise and propose an interpolation training strategy to mitigate this behavior. We further propose a novel label noise detection method that exploits the robust feature representations learned via contrastive learning to estimate per-sample soft-labels whose disagreements with the original labels accurately identify noisy samples. This detection allows treating noisy samples as unlabeled and training a classifier in a semi-supervised manner to prevent noise memorization and improve representation learning. We further propose MOIT+, a refinement of MOIT by fine-tuning on detected clean samples. Hyperparameter and ablation studies verify the key components of our method. Experiments on synthetic and real-world noise benchmarks demonstrate that MOIT/MOIT+ achieves state-of-the-art results. Code is available at https://git.io/JI40X.",
  "s2id": "01a7b0fa501e0319f3f3bbaf5d8caaee159663cc",
  "twitter": {
    "retweets": 17,
    "likes": 63,
    "replies": 1,
    "ids": [
      "1367446960739938308",
      "1336614102458884103",
      "1367442441868042246",
      "1336676707684642820",
      "1373751553509691399",
      "1373676017638772737",
      "1373570322721542145",
      "1373389081808355332",
      "1373192955742289920",
      "1372996579494334465",
      "1372815254388899843",
      "1372755154286473216",
      "1372724834552123392",
      "1336697382248075272",
      "1336501109972676615"
    ]
  },
  "citations": 1,
  "posterSession": "Tuesday"
}