{
  "arXiv": null,
  "title": "SDD-FIQA: Unsupervised Face Image Quality Assessment With Similarity Distribution Distance",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Ou_SDD-FIQA_Unsupervised_Face_Image_Quality_Assessment_With_Similarity_Distribution_Distance_CVPR_2021_paper.pdf",
  "authors": [
    "Fu-Zhao Ou",
    "Xingyu Chen",
    "Ruixin Zhang",
    "Yuge Huang",
    "Shaoxin Li",
    "Jilin Li",
    "Yong Li",
    "Liujuan Cao",
    "Yuan-Gen Wang"
  ],
  "abstract": "In recent years, Face Image Quality Assessment (FIQA) has become an indispensable part of the face recognition system to guarantee the stability and reliability of recognition performance in an unconstrained scenario. For this purpose, the FIQA method should consider both the intrinsic property and the recognizability of the face image. Most previous works aim to estimate the sample-wise embedding uncertainty or pair-wise similarity as the quality score, which only considers the partial information from the intra-class. However, these methods ignore the valuable information from the inter-class, which is for estimating the recognizability of face image. In this work, we argue that a high-quality face image should be similar to its intra-class samples and dissimilar to its inter-class samples. Thus, we propose a novel unsupervised FIQA method that incorporates Similarity Distribution Distance for Face Image Quality Assessment (SDD-FIQA). Our method generates quality pseudo-labels by calculating the Wasserstein Distance (WD) between the intra-class and inter-class similarity distributions. With these quality pseudo-labels, we are capable of training a regression network for quality prediction. Extensive experiments on benchmark datasets demonstrate that the proposed SDD-FIQA surpasses the state-of-the-arts by an impressive margin. Meanwhile, our method shows good generalization across different recognition systems.",
  "s2id": "f894d4aed5613314c407857ca02c25862651b381",
  "citations": 0,
  "posterSession": "Wednesday"
}