{
  "arXiv": "http://arxiv.org/abs/2012.00301",
  "title": "Dual Pixel Exploration: Simultaneous Depth Estimation and Image Restoration",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Pan_Dual_Pixel_Exploration_Simultaneous_Depth_Estimation_and_Image_Restoration_CVPR_2021_paper.pdf",
  "authors": [
    "Liyuan Pan",
    "Shah Chowdhury",
    "Richard Hartley",
    "Miaomiao Liu",
    "Hongguang Zhang",
    "Hongdong Li"
  ],
  "abstract": "The dual-pixel (DP) hardware works by splitting each pixel in half and creating an image pair in a single snapshot. Several works estimate depth/inverse depth by treating the DP pair as a stereo pair. However, dual-pixel disparity only occurs in image regions with the defocus blur. The heavy defocus blur in DP pairs affects the performance of matching-based depth estimation approaches. Instead of removing the blur effect blindly, we study the formation of the DP pair which links the blur and the depth information. In this paper, we propose a mathematical DP model which can benefit depth estimation by the blur. These explorations motivate us to propose an end-to-end DDDNet (DP-based Depth and Deblur Network) to jointly estimate the depth and restore the image. Moreover, we define a reblur loss, which reflects the relationship of the DP image formation process with depth information, to regularise our depth estimate in training. To meet the requirement of a large amount of data for learning, we propose the first DP image simulator which allows us to create datasets with DP pairs from any existing RGBD dataset. As a side contribution, we collect a real dataset for further research. Extensive experimental evaluation on both synthetic and real datasets shows that our approach achieves competitive performance compared to state-of-the-art approaches.",
  "s2id": "53ae88c63ec6581b49d9a358e612f70935b552cc",
  "twitter": {
    "retweets": 0,
    "likes": 5,
    "replies": 0
  },
  "citations": 1,
  "posterSession": "Tuesday"
}