{
  "arXiv": "http://arxiv.org/abs/2006.06664",
  "title": "Quasi-Dense Similarity Learning for Multiple Object Tracking",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Pang_Quasi-Dense_Similarity_Learning_for_Multiple_Object_Tracking_CVPR_2021_paper.pdf",
  "authors": [
    "Jiangmiao Pang",
    "Linlu Qiu",
    "Xia Li",
    "Haofeng Chen",
    "Qi Li",
    "Trevor Darrell",
    "Fisher Yu"
  ],
  "abstract": "Similarity learning has been recognized as a crucial step for object tracking. However, existing multiple object tracking methods only use sparse ground truth matching as the training objective, while ignoring the majority of the informative regions on the images. In this paper, we present Quasi-Dense Similarity Learning, which densely samples hundreds of region proposals on a pair of images for contrastive learning. We can directly combine this similarity learning with existing detection methods to build Quasi-Dense Tracking (QDTrack) without turning to displacement regression or motion priors. We also find that the resulting distinctive feature space admits a simple nearest neighbor search at the inference time. Despite its simplicity, QDTrack outperforms all existing methods on MOT, BDD100K, Waymo, and TAO tracking benchmarks. It achieves 68.7 MOTA at 20.3 FPS on MOT17 without using external training data. Compared to methods with similar detectors, it boosts almost 10 points of MOTA and significantly decreases the number of ID switches on BDD100K and Waymo datasets. Our code and trained models are available at https://github.com/SysCV/qdtrack.",
  "s2id": "0411073b9e8c844badd0f95d6c7333b2ece8657b",
  "twitter": {
    "retweets": 0,
    "likes": 2,
    "replies": 3,
    "ids": [
      "1271709071914172416",
      "1281336011683962887",
      "1271663902405861378",
      "1271263083277824001",
      "1271272521464152065",
      "1271278877059375105",
      "1271286213786218496",
      "1271437440893554689",
      "1271467554666614790",
      "1349365851221352448",
      "1349184616935157760",
      "1271905343363301378",
      "1272086634129952768",
      "1272282918866608134",
      "1333602116385058817",
      "1333798268006928385",
      "1333813295636230146",
      "1271256122008231939"
    ]
  },
  "citations": 1,
  "posterSession": "Monday"
}