{
  "arXiv": "http://arxiv.org/abs/2012.15838",
  "title": "Neural Body: Implicit Neural Representations With Structured Latent Codes for Novel View Synthesis of Dynamic Humans",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Peng_Neural_Body_Implicit_Neural_Representations_With_Structured_Latent_Codes_for_CVPR_2021_paper.pdf",
  "authors": [
    "Sida Peng",
    "Yuanqing Zhang",
    "Yinghao Xu",
    "Qianqian Wang",
    "Qing Shuai",
    "Hujun Bao",
    "Xiaowei Zhou"
  ],
  "abstract": "This paper addresses the challenge of novel view synthesis for a human performer from a very sparse set of camera views. Some recent works have shown that learning implicit neural representations of 3D scenes achieves remarkable view synthesis quality given dense input views. However, the representation learning will be ill-posed if the views are highly sparse. To solve this ill-posed problem, our key idea is to integrate observations over video frames. To this end, we propose Neural Body, a new human body representation which assumes that the learned neural representations at different frames share the same set of latent codes anchored to a deformable mesh, so that the observations across frames can be naturally integrated. The deformable mesh also provides geometric guidance for the network to learn 3D representations more efficiently. Experiments on a newly collected multi-view dataset show that our approach outperforms prior works by a large margin in terms of the novel view synthesis quality. We also demonstrate the capability of our approach to reconstruct a moving person from a monocular video on the People-Snapshot dataset. We will release the code and dataset for reproducibility.",
  "s2id": "af8faec7c0b8f4b2a28d42a86e0e7d499016c560",
  "twitter": {
    "retweets": 47,
    "likes": 247,
    "replies": 3,
    "ids": [
      "1344874563604275200",
      "1345446785238540289",
      "1383043248206319619",
      "1383042995201576969",
      "1370401451479085059",
      "1370391645833814019",
      "1370343533404581890",
      "1349032439310659591"
    ]
  },
  "citations": 9,
  "posterSession": "Wednesday"
}