{
  "arXiv": "http://arxiv.org/abs/2102.03728",
  "title": "Adversarial Imaging Pipelines",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Phan_Adversarial_Imaging_Pipelines_CVPR_2021_paper.pdf",
  "authors": [
    "Buu Phan",
    "Fahim Mannan",
    "Felix Heide"
  ],
  "abstract": "Adversarial attacks play a critical role in understanding deep neural network predictions and improving their robustness. Existing attack methods aim to deceive convolutional neural network (CNN)-based classifiers by manipulating RGB images that are fed directly to the classifiers. However, these approaches typically neglect the influence of the camera optics and image processing pipeline (ISP) that produce the network inputs. ISPs transform RAW measurements to RGB images and traditionally are assumed to preserve adversarial patterns. In fact, these low-level pipelines can destroy, introduce or amplify adversarial patterns that can deceive a downstream detector. As a result, optimized patterns can become adversarial for the classifier after being transformed by a certain camera ISP or optical lens system but not for others. In this work, we examine and develop such an attack that deceives a specific camera ISP while leaving others intact, using the same downstream classifier. We frame this camera-specific attack as a multi-task optimization problem, relying on a differentiable approximation for the ISP itself. We validate the proposed method using recent state-of-the-art automotive hardware ISPs, achieving 92% fooling rate when attacking a specific ISP. We demonstrate physical optics attacks with 90% fooling rate for a specific camera lens.",
  "s2id": "ff3dbf3a8bcb6a676995adcc7a0aea1c39b7bb1d",
  "twitter": {
    "retweets": 13,
    "likes": 10,
    "replies": 2,
    "ids": [
      "1360635914418982918",
      "1360673220039426048",
      "1364973115718193159",
      "1363876378567987207",
      "1363680208189083649",
      "1361072887365578755",
      "1359165421576986627",
      "1358984092717514758",
      "1358969199536857090"
    ]
  },
  "citations": 0,
  "posterSession": "Friday"
}