{
  "arXiv": "http://arxiv.org/abs/2002.05123",
  "title": "Over-the-Air Adversarial Flickering Attacks Against Video Recognition Networks",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Pony_Over-the-Air_Adversarial_Flickering_Attacks_Against_Video_Recognition_Networks_CVPR_2021_paper.pdf",
  "authors": [
    "Roi Pony",
    "Itay Naeh",
    "Shie Mannor"
  ],
  "abstract": "Deep neural networks for video classification, just like image classification networks, may be subjected to adversarial manipulation. The main difference between image classifiers and video classifiers is that the latter usually use temporal information contained within the video. In this work we present a manipulation scheme for fooling video classifiers by introducing a flickering temporal perturbation that in some cases may be unnoticeable by human observers and is implementable in the real world. After demonstrating the manipulation of action classification of single videos, we generalize the procedure to make universal adversarial perturbation, achieving high fooling ratio. In addition, we generalize the universal perturbation and produce a temporal-invariant perturbation, which can be applied to the video without synchronizing the perturbation to the input. The attack was implemented on several target models and the transferability of the attack was demonstrated. These properties allow us to bridge the gap between simulated environment and real-world application, as will be demonstrated in this paper for the first time for an over-the-air flickering attack.",
  "s2id": "ef4549c94e1ee3e2a132c63bde4c2de51396febc",
  "twitter": {
    "retweets": 0,
    "likes": 2,
    "replies": 2,
    "ids": [
      "1285020286958608391",
      "1227870931143426048",
      "1333420901514272772",
      "1333244409618591745",
      "1333239680054255619",
      "1272902150746714118",
      "1272705786410668032",
      "1227965941977427968",
      "1227815118920192000",
      "1227797249595301889",
      "1227787377843683329",
      "1227786884690186244",
      "1227784601281626112"
    ]
  },
  "citations": 1,
  "posterSession": "Monday"
}