{
  "arXiv": "http://arxiv.org/abs/2103.13141",
  "title": "Temporal Context Aggregation Network for Temporal Action Proposal Refinement",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Qing_Temporal_Context_Aggregation_Network_for_Temporal_Action_Proposal_Refinement_CVPR_2021_paper.pdf",
  "authors": [
    "Zhiwu Qing",
    "Haisheng Su",
    "Weihao Gan",
    "Dongliang Wang",
    "Wei Wu",
    "Xiang Wang",
    "Yu Qiao",
    "Junjie Yan",
    "Changxin Gao",
    "Nong Sang"
  ],
  "abstract": "Temporal action proposal generation aims to estimate temporal intervals of actions in untrimmed videos, which is a challenging yet important task in the video understanding field. The proposals generated by current methods still suffer from inaccurate temporal boundaries and inferior confidence used for retrieval owing to the lack of efficient temporal modeling and effective boundary context utilization. In this paper, we propose Temporal Context Aggregation Network (TCANet) to generate high-quality action proposals through local and global temporal context aggregation and complementary as well as progressive boundary refinement. Specifically, we first design a Local-Global Temporal Encoder (LGTE), which adopts the channel grouping strategy to efficiently encode both local and global temporal inter-dependencies. Furthermore, both the boundary and internal context of proposals are adopted for frame-level and segment-level boundary regressions, respectively. Temporal Boundary Regressor (TBR) is designed to combine these two regression granularities in an end-to-end fashion, which achieves the precise boundaries and reliable confidence of proposals through progressive refinement. Extensive experiments are conducted on three challenging datasets: HACS, ActivityNet-v1.3, and THUMOS-14, where TCANet can generate proposals with high precision and recall. By combining with the existing action classifier, TCANet can obtain remarkable temporal action detection performance compared with other methods. Not surprisingly, the proposed TCANet won the 1st place in the CVPR 2020 - HACS challenge leaderboard on temporal action localization task.",
  "s2id": "8cf51059c87a9b5abf04cf959bbf75ab6ffff8c3",
  "citations": 2,
  "posterSession": "Monday"
}