{
  "arXiv": "http://arxiv.org/abs/2105.13680",
  "title": "Focus on Local: Detecting Lane Marker From Bottom Up via Key Point",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Qu_Focus_on_Local_Detecting_Lane_Marker_From_Bottom_Up_via_CVPR_2021_paper.pdf",
  "authors": [
    "Zhan Qu",
    "Huan Jin",
    "Yang Zhou",
    "Zhen Yang",
    "Wei Zhang"
  ],
  "abstract": "Mainstream lane marker detection methods are implemented by predicting the overall structure and deriving parametric curves through post-processing. Complex lane line shapes require high-dimensional output of CNNs to model global structures, which further increases the demand for model capacity and training data. In contrast, the locality of a lane marker has finite geometric variations and spatial coverage. We propose a novel lane marker detection solution, FOLOLane, that focuses on modeling local patterns and achieving prediction of global structures in a bottom-up manner. Specifically, the CNN models low-complexity local patterns with two separate heads, the first one predicts the existence of key points, and the second refines the location of key points in the local range and correlates key points of the same lane line. The locality of the task is consistent with the limited FOV of the feature in CNN, which in turn leads to more stable training and better generalization. In addition, an efficiency-oriented decoding algorithm was proposed as well as a greedy one, which achieving 36% runtime gains at the cost of negligible performance degradation. Both of the two decoders integrated local information into the global geometry of lane markers. In the absence of a complex network architecture design, the proposed method greatly outperforms all existing methods on public datasets while achieving the best state-of-the-art results and real-time processing simultaneously.",
  "s2id": "8c63b98161df3088b4eb8f6b0472675f2bf87338",
  "twitter": {
    "retweets": 0,
    "likes": 4,
    "replies": 1
  },
  "citations": 0,
  "posterSession": "Thursday"
}