{
  "arXiv": "http://arxiv.org/abs/2008.10247",
  "title": "Monocular Reconstruction of Neural Face Reflectance Fields",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/R_Monocular_Reconstruction_of_Neural_Face_Reflectance_Fields_CVPR_2021_paper.pdf",
  "authors": [
    "Mallikarjun B R",
    "Ayush Tewari",
    "Tae-Hyun Oh",
    "Tim Weyrich",
    "Bernd Bickel",
    "Hans-Peter Seidel",
    "Hanspeter Pfister",
    "Wojciech Matusik",
    "Mohamed Elgharib",
    "Christian Theobalt"
  ],
  "abstract": "The reflectance field of a face describes the reflectance properties responsible for complex lighting effects including diffuse, specular, inter-reflection and self shadowing. Most existing methods for estimating the face reflectance from a monocular image assume faces to be diffuse with very few approaches adding a specular component. This still leaves out important perceptual aspects of reflectance such as higher-order global illumination effects and self-shadowing. We present a new neural representation for face reflectance where we can estimate all components of the reflectance responsible for the final appearance from a monocular image. Instead of modeling each component of the reflectance separately using parametric models, our neural representation allows us to generate a basis set of faces in a geometric deformation-invariant space, parameterized by the input light direction, viewpoint and face geometry. We learn to reconstruct this reflectance field of a face just from a monocular image, which can be used to render the face from any viewpoint in any light condition. Our method is trained on a light-stage dataset, which captures 300 people illuminated with 150 light conditions from 8 viewpoints. We show that our method outperforms existing monocular reflectance reconstruction methods due to better capturing of physical effects, such as sub-surface scattering, specularities, self-shadows and other higher-order effects.",
  "s2id": "750039db28d96422f0f70d337d717318837a9639",
  "twitter": {
    "retweets": 3,
    "likes": 31,
    "replies": 2
  },
  "citations": 2,
  "posterSession": "Tuesday"
}