{
  "arXiv": "http://arxiv.org/abs/2104.08391",
  "title": "Learning To Count Everything",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Ranjan_Learning_To_Count_Everything_CVPR_2021_paper.pdf",
  "authors": [
    "Viresh Ranjan",
    "Udbhav Sharma",
    "Thu Nguyen",
    "Minh Hoai"
  ],
  "abstract": "Existing works on visual counting primarily focus on one specific category at a time, such as people, animals, and cells. In this paper, we are interested in counting everything, that is to count objects from any category given only a few annotated instances from that category. To this end, we pose counting as a few-shot regression task. To tackle this task, we present a novel method that takes a query image together with a few exemplar objects from the query image and predicts a density map for the presence of all objects of interest in the query image. We also present a novel adaptation strategy to adapt our network to any novel visual category at test time, using only a few exemplar objects from the novel category. We also introduce a dataset of 147 object categories containing over 6000 images that are suitable for the few-shot counting task. The images are annotated with two types of annotation, dots and bounding boxes, and they can be used for developing few-shot counting models. Experiments on this dataset shows that our method outperforms several state-of-the-art object detectors and few-shot counting approaches. Our code and dataset can be found at https://github.com/cvlab-stonybrook/LearningToCountEverything.",
  "s2id": "6b291dea9bb80fea41f4ffa17aaad52ab5d26ada",
  "twitter": {
    "retweets": 13,
    "likes": 99,
    "replies": 3,
    "ids": [
      "1387569027791265794",
      "1337152507626328067",
      "822915978120007681",
      "758288398788493312",
      "1386688447713366019",
      "620981186438037504",
      "1384517410967982086",
      "1384383562615459842",
      "1384321032044093440",
      "1384607896642613254",
      "1386688521252089858",
      "625870962593013760",
      "277026241515773952",
      "217443967833358337",
      "206315673343897600",
      "111804484065308672",
      "30729486211227648",
      "30729274067521537"
    ]
  },
  "citations": 0,
  "posterSession": "Tuesday"
}