{
  "arXiv": "http://arxiv.org/abs/2102.02798",
  "title": "Im2Vec: Synthesizing Vector Graphics Without Vector Supervision",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Reddy_Im2Vec_Synthesizing_Vector_Graphics_Without_Vector_Supervision_CVPR_2021_paper.pdf",
  "authors": [
    "Pradyumna Reddy",
    "Michael Gharbi",
    "Michal Lukac",
    "Niloy J. Mitra"
  ],
  "abstract": "Vector graphics are widely used to represent fonts, logos, digital artworks, and graphic designs. But, while a vast body of work has focused on generative algorithms for raster images, only a handful of options exists for vector graphics. One can always rasterize the input graphic and resort to image-based generative approaches, but this negates the advantages of the vector representation. The current alternative is to use specialized models that require explicit supervision on the vector graphics representation at training time. This is not ideal because large-scale high-quality vector-graphics datasets are difficult to obtain. Furthermore, the vector representation for a given design is not unique, so models that supervise on the vector representation are unnecessarily constrained. Instead, we propose a new neural network that can generate complex vector graphics with varying topologies, and only requires in-direct supervision from readily-available raster training images (i.e., with no vector counterparts). To enable this, we use a differentiable rasterization pipeline that renders the generated vector shapes and composites them together onto a raster canvas. We demonstrate our method on a range of datasets, and provide comparison with state-of-the-art SVG-VAE and DeepSVG, both of which require explicit vector graphics supervision. Finally, we also demonstrate our approach on the MNIST dataset, for which no groundtruth vector representation is available.",
  "s2id": "a0d53bccf169c77042ffed93587fe60b0cf7b96d",
  "twitter": {
    "retweets": 188,
    "likes": 1037,
    "replies": 10,
    "ids": [
      "1371267436314431488",
      "1357516072719691777",
      "1358365125887991813",
      "1358175797811449856",
      "1371311656060342276",
      "1397913913082060806",
      "1371405826309623808",
      "1371469049624989701",
      "1371426975961743363",
      "1358274591819517952",
      "1371408906686132232",
      "1380847236582621185",
      "1371404926799187968",
      "1371404884256374787",
      "1371779281135763462",
      "1372141666094747649",
      "1372504053410889730",
      "1374352480453156866",
      "1358093392853553154"
    ]
  },
  "citations": 3,
  "posterSession": "Wednesday"
}