{
  "arXiv": "http://arxiv.org/abs/2103.06122",
  "title": "Spatially Consistent Representation Learning",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Roh_Spatially_Consistent_Representation_Learning_CVPR_2021_paper.pdf",
  "authors": [
    "Byungseok Roh",
    "Wuhyun Shin",
    "Ildoo Kim",
    "Sungwoong Kim"
  ],
  "abstract": "Self-supervised learning has been widely used to obtain transferrable representations from unlabeled images. Especially, recent contrastive learning methods have shown impressive performances on downstream image classification tasks. While these contrastive methods mainly focus on generating invariant global representations at the image-level under semantic-preserving transformations, they are prone to overlook spatial consistency of local representations and therefore have a limitation in pretraining for localization tasks such as object detection and instance segmentation. Moreover, aggressively cropped views used in existing contrastive methods can minimize representation distances between the semantically different regions of a single image. In this paper, we propose a spatially consistent representation learning algorithm (SCRL) for multi-object and location-specific tasks. In particular, we devise a novel self-supervised objective that tries to produce coherent spatial representations of a randomly cropped local region according to geometric translations and zooming operations. On various downstream localization tasks with benchmark datasets, the proposed SCRL shows significant performance improvements over the image-level supervised pretraining as well as the state-of-the-art self-supervised learning methods.",
  "s2id": "47d62aff50c6cc27c2718d918c5b666ce6fcff08",
  "twitter": {
    "retweets": 6,
    "likes": 37,
    "replies": 2,
    "ids": [
      "1369832586432897025",
      "1369840766638559235",
      "1387763813513105418",
      "1387582569772982276",
      "1383314078186151939",
      "1370037129502412800",
      "1369906460595916801",
      "1369837548927913984"
    ]
  },
  "citations": 3,
  "posterSession": "Monday"
}