{
  "arXiv": "http://arxiv.org/abs/2105.07830",
  "title": "Learning To Relate Depth and Semantics for Unsupervised Domain Adaptation",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Saha_Learning_To_Relate_Depth_and_Semantics_for_Unsupervised_Domain_Adaptation_CVPR_2021_paper.pdf",
  "authors": [
    "Suman Saha",
    "Anton Obukhov",
    "Danda Pani Paudel",
    "Menelaos Kanakis",
    "Yuhua Chen",
    "Stamatios Georgoulis",
    "Luc Van Gool"
  ],
  "abstract": "We present an approach for encoding visual task relationships to improve model performance in an Unsupervised Domain Adaptation (UDA) setting. Semantic segmentation and monocular depth estimation are shown to be complementary tasks; in a multi-task learning setting, a proper encoding of their relationships can further improve performance on both tasks. Motivated by this observation, we propose a novel Cross-Task Relation Layer (CTRL), which encodes task dependencies between the semantic and depth predictions. To capture the cross-task relationships, we propose a neural network architecture that contains task-specific and cross-task refinement heads. Furthermore, we propose an Iterative Self-Learning (ISL) training scheme, which exploits semantic pseudo-labels to provide extra supervision on the target domain. We experimentally observe improvements in both tasks' performance because the complementary information present in these tasks is better captured. Specifically, we show that: (1) our approach improves performance on all tasks when they are complementary and mutually dependent; (2) the CTRL helps to improve both semantic segmentation and depth estimation tasks performance in the challenging UDA setting; (3) the proposed ISL training scheme further improves the semantic segmentation performance. The implementation is available at https://github.com/susaha/ctrl-uda.",
  "s2id": "cdeabeba4ee636f51e4b4e773b71026ea690ac93",
  "twitter": {
    "retweets": 5,
    "likes": 53,
    "replies": 3,
    "ids": [
      "1396825852428656643",
      "1396743881094574080",
      "1394790889180913670",
      "1394572039546150914",
      "1396068931857694724",
      "1396744026695606273",
      "1394548849000140803"
    ]
  },
  "citations": 0,
  "posterSession": "Wednesday"
}