{
  "arXiv": "http://arxiv.org/abs/2104.03313",
  "title": "SCANimate: Weakly Supervised Learning of Skinned Clothed Avatar Networks",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Saito_SCANimate_Weakly_Supervised_Learning_of_Skinned_Clothed_Avatar_Networks_CVPR_2021_paper.pdf",
  "authors": [
    "Shunsuke Saito",
    "Jinlong Yang",
    "Qianli Ma",
    "Michael J. Black"
  ],
  "abstract": "We present SCANimate, an end-to-end trainable framework that takes raw 3D scans of a clothed human and turns them into an animatable avatar. These avatars are driven by pose parameters and have realistic clothing that moves and deforms naturally. SCANimate does not rely on a customized mesh template or surface mesh registration. We observe that fitting a parametric 3D body model, like SMPL, to a clothed human scan is tractable while surface registration of the body topology to the scan is often not, because clothing can deviate significantly from the body shape. We also observe that articulated transformations are invertible, resulting in geometric cycle-consistency in the posed and unposed shapes. These observations lead us to a weakly supervised learning method that aligns scans into a canonical pose by disentangling articulated deformations without template-based surface registration. Furthermore, to complete missing regions in the aligned scans while modeling pose-dependent deformations, we introduce a locally pose-aware implicit function that learns to complete and model geometry with learned pose correctives. In contrast to commonly used global pose embeddings, our local pose conditioning significantly reduces long-range spurious correlations and improves generalization to unseen poses, especially when training data is limited. Our method can be applied to pose-aware appearance modeling to generate a fully textured avatar. We demonstrate our approach on various clothing types with different amounts of training data, outperforming existing solutions and other variants in terms of fidelity and generality in every setting. The code is available at https://scanimate.is.tue.mpg.de",
  "s2id": "42bf65a6eb1cb5fda999373c3ce7d79690133c92",
  "twitter": {
    "retweets": 11,
    "likes": 66,
    "replies": 2,
    "ids": [
      "1380018124792201217",
      "1380130593833246720",
      "1380700330502000647",
      "1380334147462389763",
      "1380333998312812545"
    ]
  },
  "citations": 4,
  "posterSession": "Tuesday"
}