{
  "arXiv": "http://arxiv.org/abs/2102.06696",
  "title": "Efficient Conditional GAN Transfer With Knowledge Propagation Across Classes",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Shahbazi_Efficient_Conditional_GAN_Transfer_With_Knowledge_Propagation_Across_Classes_CVPR_2021_paper.pdf",
  "authors": [
    "Mohamad Shahbazi",
    "Zhiwu Huang",
    "Danda Pani Paudel",
    "Ajad Chhatkuli",
    "Luc Van Gool"
  ],
  "abstract": "Generative adversarial networks (GANs) have shown impressive results in both unconditional and conditional image generation. In recent literature, it is shown that pre-trained GANs, on a different dataset, can be transferred to improve the image generation from a small target data. The same, however, has not been well-studied in the case of conditional GANs (cGANs), which provides new opportunities for knowledge transfer compared to unconditional setup. In particular, the new classes may borrow knowledge from the related old classes, or share knowledge among themselves to improve the training. This motivates us to study the problem of efficient conditional GAN transfer with knowledge propagation across classes. To address this problem, we introduce a new GAN transfer method to explicitly propagate the knowledge from the old classes to the new classes. The key idea is to enforce the popularly used conditional batch normalization (BN) to learn the class-specific information of the new classes from that of the old classes, with implicit knowledge sharing among the new ones. This allows for an efficient knowledge propagation from the old classes to the new ones, with the BN parameters increasing linearly with the number of new classes. The extensive evaluation demonstrates the clear superiority of the proposed method over state-of-the-art competitors for efficient conditional GAN transfer tasks. The code is available at: https://github.com/mshahbazi72/cGANTransfer",
  "s2id": "8ebbfb708ed3671b756d5b54993c2d1f566facd1",
  "twitter": {
    "retweets": 18,
    "likes": 104,
    "replies": 6,
    "ids": [
      "1367096532927938561",
      "1361137218174214151",
      "1363662665990594562",
      "1376863453512630279",
      "1369295880617082890",
      "1363224373633630209",
      "1361420523763212288",
      "1361420311296495617"
    ]
  },
  "citations": 0,
  "posterSession": "Thursday"
}