{
  "arXiv": "http://arxiv.org/abs/2103.15407",
  "title": "Self-Supervised Visibility Learning for Novel View Synthesis",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Shi_Self-Supervised_Visibility_Learning_for_Novel_View_Synthesis_CVPR_2021_paper.pdf",
  "authors": [
    "Yujiao Shi",
    "Hongdong Li",
    "Xin Yu"
  ],
  "abstract": "We address the problem of novel view synthesis (NVS) from a few sparse source view images. Conventional image-based rendering methods estimate scene geometry and synthesize novel views in two separate steps. However, erroneous geometry estimation will decrease NVS performance as view synthesis highly depends on the quality of estimated scene geometry. In this paper, we propose an end-to-end NVS framework to eliminate the error propagation issue. To be specific, we construct a volume under the target view and design a source-view visibility estimation (SVE) module to determine the visibility of the target-view voxels in each source view. Next, we aggregate the visibility of all source views to achieve a consensus volume. Each voxel in the consensus volume indicates a surface existence probability. Then, we present a soft ray-casting (SRC) mechanism to find the most front surface in the target view (i.e. depth). Specifically, our SRC traverses the consensus volume along viewing rays and then estimates a depth probability distribution. We then warp and aggregate source view pixels to synthesize a novel view based on the estimated source-view visibility and target-view depth. At last, our network is trained in an end-to-end self-supervised fashion, thus significantly alleviating error accumulation in view synthesis. Experimental results demonstrate that our method generates novel views in higher quality compared to the state-of-the-art.",
  "s2id": "9bb2003f59c1e2b542139e869cdc0ed4ebd13217",
  "twitter": {
    "retweets": 7,
    "likes": 34,
    "replies": 0,
    "ids": [
      "1376722291762073601",
      "1379360387162763270"
    ]
  },
  "citations": 0,
  "posterSession": "Wednesday"
}