{
  "arXiv": "http://arxiv.org/abs/2103.11922",
  "title": "Prioritized Architecture Sampling With Monto-Carlo Tree Search",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Su_Prioritized_Architecture_Sampling_With_Monto-Carlo_Tree_Search_CVPR_2021_paper.pdf",
  "authors": [
    "Xiu Su",
    "Tao Huang",
    "Yanxi Li",
    "Shan You",
    "Fei Wang",
    "Chen Qian",
    "Changshui Zhang",
    "Chang Xu"
  ],
  "abstract": "One-shot neural architecture search (NAS) methods significantly reduce the search cost by considering the whole search space as one network, which only needs to be trained once. However, current methods select each operation independently without considering previous layers. Besides, the historical information obtained with huge computation costs is usually used only once and then discarded. In this paper, we introduce a sampling strategy based on Monte Carlo tree search (MCTS) with the search space modeled as a Monte Carlo tree (MCT), which captures the dependency among layers. Furthermore, intermediate results are stored in the MCT for future decisions and a better exploration-exploitation balance. Concretely, MCT is updated using the training loss as a reward to the architecture performance; for accurately evaluating the numerous nodes, we propose node communication and hierarchical node selection methods in the training and search stages, respectively, making better uses of the operation rewards and hierarchical information. Moreover, for a fair comparison of different NAS methods, we construct an open-source NAS benchmark of a macro search space evaluated on CIFAR-10, namely NAS-Bench-Macro. Extensive experiments on NAS-Bench-Macro and ImageNet demonstrate that our method significantly improves search efficiency and performance. For example, by only searching 20 architectures, our obtained architecture achieves 78.0% top-1 accuracy with 442M FLOPs on ImageNet. Code (Benchmark) is available at: https://github.com/xiusu/NAS-Bench-Macro.",
  "s2id": "2f5d358481b170282f8cd0d97b6387ed521fffd4",
  "citations": 1,
  "posterSession": "Wednesday"
}