{
  "arXiv": "http://arxiv.org/abs/2103.13516",
  "title": "Tracking Pedestrian Heads in Dense Crowd",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Sundararaman_Tracking_Pedestrian_Heads_in_Dense_Crowd_CVPR_2021_paper.pdf",
  "authors": [
    "Ramana Sundararaman",
    "Cedric De Almeida Braga",
    "Eric Marchand",
    "Julien Pettre"
  ],
  "abstract": "Tracking humans in crowded video sequences is an important constituent of visual scene understanding. Increasing crowd density challenges visibility of humans, limiting the scalability of existing pedestrian trackers to higher crowd densities. For that reason, we propose to revitalize head tracking with Crowd of Heads Dataset (CroHD), consisting of 9 sequences of 11,463 frames with over 2,276,838 heads and 5,230 tracks annotated in diverse scenes. For evaluation, we proposed a new metric, IDEucl, to measure an algorithm's efficacy in preserving a unique identity for the longest stretch in image coordinate space, thus building a correspondence between pedestrian crowd motion and the performance of a tracking algorithm. Moreover, we also propose a new head detector, HeadHunter, which is designed for small head detection in crowded scenes. We extend HeadHunter with a Particle Filter and a color histogram based re-identification module for head tracking. To establish this as a strong baseline, we compare our tracker with existing state-of-the-art pedestrian trackers on CroHD and demonstrate superiority, especially in identity preserving tracking metrics. With a light-weight head detector and a tracker which is efficient at identity preservation, we believe our contributions will serve useful in advancement of pedestrian tracking in dense crowds. We make our dataset, code and models publicly available at https://project.inria.fr/crowdscience/project/dense-crowd-head-tracking/.",
  "s2id": "b9aec7d67f75c85df54339d1abb0a40ffb3a8885",
  "twitter": {
    "retweets": 0,
    "likes": 1,
    "replies": 0,
    "ids": [
      "1376076809335373824",
      "1376272955395694594",
      "1375880432378654730",
      "1375835097560195087",
      "1375638840191385600",
      "1375518094513205249",
      "1375442647360405508",
      "1375291592643252231",
      "1375261318714957824"
    ]
  },
  "citations": 0,
  "posterSession": "Tuesday"
}