{
  "arXiv": null,
  "title": "Fast End-to-End Learning on Protein Surfaces",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Sverrisson_Fast_End-to-End_Learning_on_Protein_Surfaces_CVPR_2021_paper.pdf",
  "authors": [
    "Freyr Sverrisson",
    "Jean Feydy",
    "Bruno E. Correia",
    "Michael M. Bronstein"
  ],
  "abstract": "Proteins' biological functions are defined by the geometric and chemical structure of their 3D molecular surfaces. Recent works have shown that geometric deep learning can be used on mesh-based representations of proteins to identify potential functional sites, such as binding targets for potential drugs. Unfortunately though, the use of meshes as the underlying representation for protein structure has multiple drawbacks including the need to pre-compute the input features and mesh connectivities. This becomes a bottleneck for many important tasks in protein science. In this paper, we present a new framework for deep learning on protein structures that addresses these limitations. Among the key advantages of our method are the computation and sampling of the molecular surface on-the-fly from the underlying atomic point cloud and a novel efficient geometric convolutional layer. As a result, we are able to process large collections of proteins in an end-to-end fashion, taking as the sole input the raw 3D coordinates and chemical types of their atoms, eliminating the need for any hand-crafted pre-computed features. To showcase the performance of our approach, we test it on two tasks in the field of protein structural bioinformatics: the identification of interaction sites and the prediction of protein-protein interactions. On both tasks, we achieve state-of-the-art performance with much faster run times and fewer parameters than previous models. These results will considerably ease the deployment of deep learning methods in protein science and open the door for end-to-end differentiable approaches in protein modeling tasks such as function prediction and design.",
  "s2id": "1f089508bbcd0a5c083cb6077adb133774eca5d7",
  "twitter": {
    "retweets": 21,
    "likes": 81,
    "replies": 3,
    "ids": [
      "1344211640238157825",
      "1344142834379665411",
      "1344203242608209920",
      "1344142833599602689",
      "1388663960304427009",
      "1344193541195640838"
    ]
  },
  "citations": 2,
  "posterSession": "Thursday"
}