{
  "arXiv": "http://arxiv.org/abs/2012.02189",
  "title": "Learned Initializations for Optimizing Coordinate-Based Neural Representations",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Tancik_Learned_Initializations_for_Optimizing_Coordinate-Based_Neural_Representations_CVPR_2021_paper.pdf",
  "authors": [
    "Matthew Tancik",
    "Ben Mildenhall",
    "Terrance Wang",
    "Divi Schmidt",
    "Pratul P. Srinivasan",
    "Jonathan T. Barron",
    "Ren Ng"
  ],
  "abstract": "Coordinate-based neural representations have shown significant promise as an alternative to discrete, array-based representations for complex low dimensional signals. However, optimizing a coordinate-based network from randomly initialized weights for each new signal is inefficient. We propose applying standard meta-learning algorithms to learn the initial weight parameters for these fully-connected networks based on the underlying class of signals being represented (e.g., images of faces or 3D models of chairs). Despite requiring only a minor change in implementation, using these learned initial weights enables faster convergence during optimization and can serve as a strong prior over the signal class being modeled, resulting in better generalization when only partial observations of a given signal are available. We explore these benefits across a variety of tasks, including representing 2D images, reconstructing CT scans, and recovering 3D shapes and scenes from 2D image observations.",
  "s2id": "463e5c147fe2ab987925768c4b6b00de9d000d30",
  "twitter": {
    "retweets": 3,
    "likes": 72,
    "replies": 1,
    "ids": [
      "1334700279623770112",
      "1339236864776138777",
      "1335089258571264001",
      "1391818858160222214",
      "1364147173944791040",
      "1375122880237801477",
      "1335277995909664771",
      "1335655635908694016",
      "1335474342201864192",
      "1335081688322469890",
      "1334885341153603587",
      "1334689190026612736"
    ]
  },
  "citations": 16,
  "posterSession": "Tuesday"
}