{
  "arXiv": "http://arxiv.org/abs/2007.12140",
  "title": "HITNet: Hierarchical Iterative Tile Refinement Network for Real-time Stereo Matching",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Tankovich_HITNet_Hierarchical_Iterative_Tile_Refinement_Network_for_Real-time_Stereo_Matching_CVPR_2021_paper.pdf",
  "authors": [
    "Vladimir Tankovich",
    "Christian Hane",
    "Yinda Zhang",
    "Adarsh Kowdle",
    "Sean Fanello",
    "Sofien Bouaziz"
  ],
  "abstract": "This paper presents HITNet, a novel neural network architecture for real-time stereo matching. Contrary to many recent neural network approaches that operate on a full costvolume and rely on 3D convolutions, our approach does not explicitly build a volume and instead relies on a fast multi-resolution initialization step, differentiable 2D geometric propagation and warping mechanisms to infer disparity hypotheses. To achieve a high level of accuracy, our network not only geometrically reasons about disparities but also infers slanted plane hypotheses allowing to more accurately perform geometric warping and upsampling operations. Our architecture is inherently multi-resolution allowing the propagation of information across different levels. Multiple experiments prove the effectiveness of the proposed approach at a fraction of the computation required by the state-of-the-art methods. At the time of writing, HITNet ranks 1st-3rd on all the metrics published on the ETH3D website for two view stereo, ranks 1st on most of the metrics amongst all the end-to-end learning approaches on Middleburyv3, ranks 1st on the popular KITTI 2012 and 2015 benchmarks among the published methods faster than 100ms.",
  "s2id": "e12a28f8a742b6b3c29fe2ace39068033a07f761",
  "twitter": {
    "retweets": 3,
    "likes": 16,
    "replies": 1,
    "ids": [
      "1286746832693948416",
      "1287276763559665669",
      "1287095530305314818",
      "1286914245712543744",
      "1286696652372353025",
      "1350106355865059329",
      "1287472844159569920",
      "1286853940840194049",
      "1286723452792008705",
      "1286672734664249344",
      "1286497548547641348",
      "1286476481389047808"
    ]
  },
  "citations": 4,
  "posterSession": "Thursday"
}