{
  "arXiv": "http://arxiv.org/abs/2103.12731",
  "title": "Scaling Local Self-Attention for Parameter Efficient Visual Backbones",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Vaswani_Scaling_Local_Self-Attention_for_Parameter_Efficient_Visual_Backbones_CVPR_2021_paper.pdf",
  "authors": [
    "Ashish Vaswani",
    "Prajit Ramachandran",
    "Aravind Srinivas",
    "Niki Parmar",
    "Blake Hechtman",
    "Jonathon Shlens"
  ],
  "abstract": "Self-attention has the promise of improving computer vision systems due to parameter-independent scaling of receptive fields and content-dependent interactions, in contrast to parameter-dependent scaling and content-independent interactions of convolutions. Self-attention models have recently been shown to have encouraging improvements on accuracy-parameter trade-offs compared to baseline convolutional models such as ResNet-50. In this work, we develop self-attention models that can outperform not just the canonical baseline models, but even the high-performing convolutional models. We propose two extensions to self-attention that, in conjunction with a more efficient implementation of self-attention, improve the speed, memory usage, and accuracy of these models. We leverage these improvements to develop a new self-attention model family, HaloNets, which reach state-of-the-art accuracies on the parameter-limited setting of the ImageNet classification benchmark. In preliminary transfer learning experiments, we find that HaloNet models outperform much larger models and have better inference performance. On harder tasks such as object detection and instance segmentation, our simple local self-attention and convolutional hybrids show improvements over very strong baselines. These results mark another step in demonstrating the efficacy of self-attention models on settings traditionally dominated by convolutions.",
  "s2id": "91e8117e7ebc966bc76de2cb52ec717d2acdb1a4",
  "twitter": {
    "retweets": 67,
    "likes": 346,
    "replies": 2,
    "ids": [
      "1374525155448295427",
      "1376656779484925956",
      "1376720133654159361",
      "1376658112308899842",
      "1374526816367472648",
      "1379976693083860994",
      "1375784278756360193",
      "1379887252977901569",
      "1377778054911627264",
      "1376727078108733442",
      "1375765547850346496",
      "1374798643371380736"
    ]
  },
  "citations": 16,
  "posterSession": "Thursday"
}