{
  "arXiv": "http://arxiv.org/abs/2104.03541",
  "title": "Multiple Object Tracking With Correlation Learning",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Wang_Multiple_Object_Tracking_With_Correlation_Learning_CVPR_2021_paper.pdf",
  "authors": [
    "Qiang Wang",
    "Yun Zheng",
    "Pan Pan",
    "Yinghui Xu"
  ],
  "abstract": "Recent works have shown that convolutional networks have substantially improved the performance of multiple object tracking by simultaneously learning detection and appearance features. However, due to the local perception of the convolutional network structure itself, the long-range dependencies in both the spatial and temporal cannot be obtained efficiently. To incorporate the spatial layout, we propose to exploit the local correlation module to model the topological relationship between targets and their surrounding environment, which can enhance the discriminative power of our model in crowded scenes. Specifically, we establish dense correspondences of each spatial location and its context, and explicitly constrain the correlation volumes through self-supervised learning. To exploit the temporal context, existing approaches generally utilize two or more adjacent frames to construct an enhanced feature representation, but the dynamic motion scene is inherently difficult to depict via CNNs. Instead, our paper proposes a learnable correlation operator to establish frame-to-frame matches over convolutional feature maps in the different layers to align and propagate temporal context. With extensive experimental results on the MOT datasets, our approach demonstrates the effectiveness of correlation learning with the superior performance and obtains state-of-the-art MOTA of 76.5% and IDF1 of 73.6% on MOT17.",
  "s2id": "88a3579aecc1f0c7a3d5b57a5c07cd51c242b3c4",
  "twitter": {
    "retweets": 0,
    "likes": 2,
    "replies": 0,
    "ids": [
      "1381271143173255182",
      "1380893683378237442",
      "1381089875345215489",
      "1380984242092433408",
      "1380712346813874176",
      "1380516065038495745",
      "1380334795713052675"
    ]
  },
  "citations": 0,
  "posterSession": "Tuesday"
}