{
  "arXiv": "http://arxiv.org/abs/2008.03813",
  "title": "Unsupervised Feature Learning by Cross-Level Instance-Group Discrimination",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Wang_Unsupervised_Feature_Learning_by_Cross-Level_Instance-Group_Discrimination_CVPR_2021_paper.pdf",
  "authors": [
    "Xudong Wang",
    "Ziwei Liu",
    "Stella X. Yu"
  ],
  "abstract": "Unsupervised feature learning has made great strides with contrastive learning based on instance discrimination and invariant mapping, as benchmarked on curated class-balanced datasets. However, natural data could be highly correlated and long-tail distributed. Natural between-instance similarity conflicts with the presumed instance distinction, causing unstable training and poor performance. Our idea is to discover and integrate between-instance similarity into contrastive learning, not directly by instance grouping, but by cross-level discrimination (CLD) between instances and local instance groups. While invariant mapping of each instance is imposed by attraction within its augmented views, between-instance similarity emerges from common repulsion against instance groups. Our batch-wise and cross-view comparisons also greatly improve the positive/negative sample ratio of contrastive learning and achieve better invariant mapping. To effect both grouping and discrimination objectives, we impose them on features separately derived from a shared representation. In addition, we propose normalized projection heads and unsupervised hyper-parameter tuning for the first time. Our extensive experimentation demonstrates that CLD is a lean and powerful add-on to existing methods (e.g., NPID, MoCo, InfoMin, BYOL) on highly correlated, long-tail, or balanced datasets. It not only achieves new state-of-the-art on self-supervision, semi-supervision, and transfer learning benchmarks, but also beats MoCo v2 and SimCLR on every reported performance attained with a much larger compute. CLD effectively extends unsupervised learning to natural data and brings it closer to real-world applications.",
  "s2id": "ce0fc0cc8a7eda062dd6a7f1c85a4e92048f90a3",
  "twitter": {
    "retweets": 5,
    "likes": 28,
    "replies": 1,
    "ids": [
      "1335852532178976768",
      "1313549876018503686",
      "1313293257036697601",
      "1314917291793035265",
      "1293091636415795201",
      "1313489498551050241",
      "1295868338749558785",
      "1295717557404672015",
      "1295536179396390915",
      "1293233568936861697",
      "1293180724963614720",
      "1293014486484430859",
      "1292999304890716160"
    ]
  },
  "citations": 0,
  "posterSession": "Thursday"
}