{
  "arXiv": "http://arxiv.org/abs/2105.02545",
  "title": "Unsupervised Visual Representation Learning by Tracking Patches in Video",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Wang_Unsupervised_Visual_Representation_Learning_by_Tracking_Patches_in_Video_CVPR_2021_paper.pdf",
  "authors": [
    "Guangting Wang",
    "Yizhou Zhou",
    "Chong Luo",
    "Wenxuan Xie",
    "Wenjun Zeng",
    "Zhiwei Xiong"
  ],
  "abstract": "Inspired by the fact that human eyes continue to develop tracking ability in early and middle childhood, we propose to use tracking as a proxy task for a computer vision system to learn the visual representations. Modelled on the Catch game played by the children, we design a Catch-the-Patch (CtP) game for a 3D-CNN model to learn visual representations that would help with video-related tasks. In the proposed pretraining framework, we cut an image patch from a given video and let it scale and move according to a pre-set trajectory. The proxy task is to estimate the position and size of the image patch in a sequence of video frames, given only the target bounding box in the first frame. We discover that using multiple image patches simultaneously brings clear benefits. We further increase the difficulty of the game by randomly making patches invisible. Extensive experiments on mainstream benchmarks demonstrate the superior performance of CtP against other video pretraining methods. In addition, CtP-pretrained features are less sensitive to domain gaps than those trained by a supervised action recognition task. When both trained on Kinetics-400, we are pleasantly surprised to find that CtP-pretrained representation achieves much higher action classification accuracy than its fully supervised counterpart on Something-Something dataset.",
  "s2id": "1d1423e06246676391286a9b8599f30b6da19070",
  "twitter": {
    "retweets": 10,
    "likes": 66,
    "replies": 2,
    "ids": [
      "1390515105553600516",
      "1391032252348264448",
      "1401654445423968256"
    ]
  },
  "citations": 0,
  "posterSession": "Monday"
}