{
  "arXiv": "http://arxiv.org/abs/2009.05769",
  "title": "Removing the Background by Adding the Background: Towards Background Robust Self-Supervised Video Representation Learning",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Wang_Removing_the_Background_by_Adding_the_Background_Towards_Background_Robust_CVPR_2021_paper.pdf",
  "authors": [
    "Jinpeng Wang",
    "Yuting Gao",
    "Ke Li",
    "Yiqi Lin",
    "Andy J. Ma",
    "Hao Cheng",
    "Pai Peng",
    "Feiyue Huang",
    "Rongrong Ji",
    "Xing Sun"
  ],
  "abstract": "Self-supervised learning has shown great potentials in improving the video representation ability of deep neural networks by getting supervision from the data itself. However, some of the current methods tend to cheat from the background, i.e., the prediction is highly dependent on the video background instead of the motion, making the model vulnerable to background changes. To mitigate the model reliance towards the background, we propose to remove the background impact by adding the background. That is, given a video, we randomly select a static frame and add it to every other frames to construct a distracting video sample. Then we force the model to pull the feature of the distracting video and the feature of the original video closer, so that the model is explicitly restricted to resist the background influence, focusing more on the motion changes. We term our method as Background Erasing (BE). It is worth noting that the implementation of our method is so simple and neat and can be added to most of the SOTA methods without much efforts. Specifically, BE brings 16.4% and 19.1% improvements with MoCo on the severely biased datasets UCF101 and HMDB51, and 14.5% improvement on the less biased dataset Diving48.",
  "s2id": "01637f04eac8523b6c4887d419bd718f65860982",
  "twitter": {
    "retweets": 0,
    "likes": 0,
    "replies": 1,
    "ids": [
      "1305764389430210561",
      "1305697591493980162",
      "1305694069369106432"
    ]
  },
  "citations": 2,
  "posterSession": "Thursday"
}