{
  "arXiv": "http://arxiv.org/abs/2104.14540",
  "title": "The Temporal Opportunist: Self-Supervised Multi-Frame Monocular Depth",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Watson_The_Temporal_Opportunist_Self-Supervised_Multi-Frame_Monocular_Depth_CVPR_2021_paper.pdf",
  "authors": [
    "Jamie Watson",
    "Oisin Mac Aodha",
    "Victor Prisacariu",
    "Gabriel Brostow",
    "Michael Firman"
  ],
  "abstract": "Self-supervised monocular depth estimation networks are trained to predict scene depth using nearby frames as a supervision signal during training. However, for many applications, sequence information in the form of video frames is also available at test time. The vast majority of monocular networks do not make use of this extra signal, thus ignoring valuable information that could be used to improve the predicted depth. Those that do, either use computationally expensive test-time refinement techniques or off-the-shelf recurrent networks, which only indirectly make use of the geometric information that is inherently available. We propose ManyDepth, an adaptive approach to dense depth estimation that can make use of sequence information at test time, when it is available. Taking inspiration from multi-view stereo, we propose a deep end-to-end cost volume based approach that is trained using self-supervision only. We present a novel consistency loss that encourages the network to ignore the cost volume when it is deemed unreliable, e.g. in the case of moving objects, and an augmentation scheme to cope with static cameras. Our detailed experiments on both KITTI and Cityscapes show that we outperform all published self-supervised baselines, including those that use single or multiple frames at test time.",
  "s2id": "518fbd94b9bb65a550adb36ee1d38b90cd62d8ea",
  "twitter": {
    "retweets": 51,
    "likes": 244,
    "replies": 5,
    "ids": [
      "1388325519515607042",
      "1389602833947893765",
      "1390469106202144770",
      "1393163369847287815",
      "1388374832564166656",
      "1389602913274707969",
      "1396204674806657024",
      "1391358996221726722",
      "1390110831635927041",
      "1388887508616892422",
      "1388283787553828865"
    ]
  },
  "citations": 1,
  "posterSession": "Monday"
}