{
  "arXiv": "http://arxiv.org/abs/2004.01178",
  "title": "Unsupervised Real-World Image Super Resolution via Domain-Distance Aware Training",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Wei_Unsupervised_Real-World_Image_Super_Resolution_via_Domain-Distance_Aware_Training_CVPR_2021_paper.pdf",
  "authors": [
    "Yunxuan Wei",
    "Shuhang Gu",
    "Yawei Li",
    "Radu Timofte",
    "Longcun Jin",
    "Hengjie Song"
  ],
  "abstract": "These days, unsupervised super-resolution (SR) is soaring due to its practical and promising potential in real scenarios. The philosophy of off-the-shelf approaches lies in the augmentation of unpaired data, i.e. first generating synthetic low-resolution (LR) images Y^g corresponding to real-world high-resolution (HR) images X^r in the real-world LR domain Y^r, and then utilizing the pseudo pairs Y^g, X^r for training in a supervised manner. Unfortunately, since image translation itself is an extremely challenging task, the SR performance of these approaches is severely limited by the domain gap between generated synthetic LR images and real LR images. In this paper, we propose a novel domain-distance aware super-resolution (DASR) approach for unsupervised real-world image SR. The domain gap between training data (e.g. Y^g) and testing data (e.g. Y^r) is addressed with our domain-gap aware training and domain-distance weighted supervision strategies. Domain-gap aware training takes additional benefit from real data in the target domain while domain-distance weighted supervision brings forward the more rational use of labeled source domain data. The proposed method is validated on synthetic and real datasets and the experimental results show that DASR consistently outperforms state-of-the-art unsupervised SR approaches in generating SR outputs with more realistic and natural textures. Codes are available at https://github.com/ShuhangGu/DASR.",
  "s2id": "6bd247938c4067bf94c12462cd0501912cb2ccdb",
  "twitter": {
    "retweets": 9,
    "likes": 37,
    "replies": 3
  },
  "citations": 7,
  "posterSession": "Thursday"
}