{
  "arXiv": "http://arxiv.org/abs/2006.14580",
  "title": "Backdoor Attacks Against Deep Learning Systems in the Physical World",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Wenger_Backdoor_Attacks_Against_Deep_Learning_Systems_in_the_Physical_World_CVPR_2021_paper.pdf",
  "authors": [
    "Emily Wenger",
    "Josephine Passananti",
    "Arjun Nitin Bhagoji",
    "Yuanshun Yao",
    "Haitao Zheng",
    "Ben Y. Zhao"
  ],
  "abstract": "Backdoor attacks embed hidden malicious behaviors into deep learning models, which only activate and cause misclassifications on model inputs containing a specific \"trigger.\" Existing works on backdoor attacks and defenses, however, mostly focus on digital attacks that apply digitally generated patterns as triggers. A critical question remains unanswered: \"can backdoor attacks succeed using physical objects as triggers, making them a credible threat against deep learning systems in the real world?\" We conduct a detailed empirical study to explore this question for facial recognition, a critical deep learning task. Using 7 physical objects as triggers, we collect a custom dataset of 3205 images of 10 volunteers and use it to study the feasibility of \"physical\" backdoor attacks under a variety of real-world conditions. Our study reveals two key findings. First, physical backdoor attacks can be highly successful if they are carefully configured to overcome the constraints imposed by physical objects. In particular, the placement of successful triggers is largely constrained by the victim model's dependence on key facial features. Second, four of today's state-of-the-art defenses against (digital) backdoors are ineffective against physical backdoors, because the use of physical objects breaks core assumptions used to construct these defenses. Our study confirms that (physical) backdoor attacks are not a hypothetical phenomenon but rather pose a serious real-world threat to critical classification tasks. We need new and more robust defenses against backdoors in the physical world.",
  "s2id": "9cde70cde39e719133f2d9553f961e0921f7f566",
  "twitter": {
    "retweets": 4,
    "likes": 3,
    "replies": 3
  },
  "citations": 0
}