{
  "arXiv": "http://arxiv.org/abs/1905.12794",
  "title": "Fashion IQ: A New Dataset Towards Retrieving Images by Natural Language Feedback",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Wu_Fashion_IQ_A_New_Dataset_Towards_Retrieving_Images_by_Natural_CVPR_2021_paper.pdf",
  "authors": [
    "Hui Wu",
    "Yupeng Gao",
    "Xiaoxiao Guo",
    "Ziad Al-Halah",
    "Steven Rennie",
    "Kristen Grauman",
    "Rogerio Feris"
  ],
  "abstract": "Conversational interfaces for the detail-oriented retail fashion domain are more natural, expressive, and user friendly than classical keyword-based search interfaces. In this paper, we introduce the Fashion IQ dataset to support and advance research on interactive fashion image retrieval. Fashion IQ is the first fashion dataset to provide human-generated captions that distinguish similar pairs of garment images together with side-information consisting of real-world product descriptions and derived visual attribute labels for these images. We provide a detailed analysis of the characteristics of the Fashion IQ data, and present a transformer-based user simulator and interactive image retriever that can seamlessly integrate visual attributes with image features, user feedback, and dialog history, leading to improved performance over the state of the art in dialog-based image retrieval. We believe that our dataset will encourage further work on developing more natural and real-world applicable conversational shopping assistants.",
  "s2id": "d98b074b37b2ce6551af320c36d506462640d977",
  "twitter": {
    "retweets": 16,
    "likes": 47,
    "replies": 3,
    "ids": [
      "1135354239595687941",
      "1161110842009620481",
      "1134271449462476800",
      "1212383260787007488",
      "1212201970049658880",
      "1134469679358103552",
      "1134275522882625542",
      "1212209456513110018",
      "1135224658729586689",
      "1135028584077320193",
      "1134847344325877760",
      "1134651079445139456",
      "1134318676088254464",
      "1134281474671353856",
      "1134273485734326272"
    ]
  },
  "citations": 8,
  "posterSession": "Wednesday"
}