{
  "arXiv": "http://arxiv.org/abs/2004.14525",
  "title": "MobileDets: Searching for Object Detection Architectures for Mobile Accelerators",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Xiong_MobileDets_Searching_for_Object_Detection_Architectures_for_Mobile_Accelerators_CVPR_2021_paper.pdf",
  "authors": [
    "Yunyang Xiong",
    "Hanxiao Liu",
    "Suyog Gupta",
    "Berkin Akin",
    "Gabriel Bender",
    "Yongzhe Wang",
    "Pieter-Jan Kindermans",
    "Mingxing Tan",
    "Vikas Singh",
    "Bo Chen"
  ],
  "abstract": "Inverted bottleneck layers, which are built upon depthwise convolutions, have been the predominant building blocks in state-of-the-art object detection models on mobile devices. In this work, we investigate the optimality of this design pattern over a broad range of mobile accelerators by revisiting the usefulness of regular convolutions. We discover that regular convolutions are a potent component to boost the latency-accuracy trade-off for object detection on accelerators, provided that they are placed strategically in the network via neural architecture search. By incorporating regular convolutions in the search space and directly optimizing the network architectures for object detection, we obtain a family of object detection models, MobileDets, that achieve state-of-the-art results across mobile accelerators. On the COCO object detection task, MobileDets outperform MobileNetV3+SSDLite by 1.7 mAP at comparable mobile CPU inference latencies. MobileDets also outperform MobileNetV2+SSDLite by 1.9 mAP on mobile CPUs, 3.7 mAP on Google EdgeTPU, 3.4 mAP on Qualcomm Hexagon DSP and 2.7 mAP on Nvidia Jetson GPU without increasing latency. Moreover, MobileDets are comparable with the state-of-the-art MnasFPN on mobile CPUs even without using the feature pyramid, and achieve better mAP scores on both EdgeTPUs and DSPs with up to 2x speedup. Code and models are available in the TensorFlow Object Detection API: https://github.com/tensorflow/models/tree/master/research/object_detection.",
  "s2id": "0449c88867dec952945fc99749cc656df25c38b2",
  "twitter": {
    "retweets": 23,
    "likes": 51,
    "replies": 4,
    "ids": [
      "1256111240406896643",
      "1256685147912429570",
      "1257377735942508546",
      "1256781518602551296",
      "1284054990558912512",
      "1287066340981866496",
      "1282671306815811584",
      "1282626079711100928",
      "1256217043357118464",
      "1256836164868243457",
      "1256458679676796928",
      "1257032375621599237",
      "1256654747689508865",
      "1256035749058744326",
      "1256413236750139393",
      "1256322633081053186",
      "1256056053692694529",
      "1256118579369517057",
      "1391714133314265090",
      "1379485310849970178",
      "1266871237948497920",
      "1280211303739596805",
      "1282474975266512898",
      "1282495942390722560",
      "1308952719814664193",
      "1355526605993631749",
      "1379435875394719754",
      "1256033643761291264"
    ]
  },
  "citations": 12,
  "posterSession": "Tuesday"
}