{
  "arXiv": "http://arxiv.org/abs/2011.14021",
  "title": "Rethinking Text Segmentation: A Novel Dataset and a Text-Specific Refinement Approach",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Xu_Rethinking_Text_Segmentation_A_Novel_Dataset_and_a_Text-Specific_Refinement_CVPR_2021_paper.pdf",
  "authors": [
    "Xingqian Xu",
    "Zhifei Zhang",
    "Zhaowen Wang",
    "Brian Price",
    "Zhonghao Wang",
    "Humphrey Shi"
  ],
  "abstract": "Text segmentation is a prerequisite in many real-world text-related tasks, e.g., text style transfer, and scene text removal. However, facing the lack of high-quality datasets and dedicated investigations, this critical prerequisite has been left as an assumption in many works, and has been largely overlooked by current research. To bridge this gap, we proposed TextSeg, a large-scale fine-annotated text dataset with six types of annotations: word- and character-wise bounding polygons, masks, and transcriptions. We also introduce Text Refinement Network (TexRNet), a novel text segmentation approach that adapts to the unique properties of text, e.g. non-convex boundary, diverse texture, etc., which often impose burdens on traditional segmentation models. In our TexRNet, we propose text-specific network designs to address such challenges, including key features pooling and attention-based similarity checking. We also introduce trimap and discriminator losses that show significant improvement in text segmentation. Extensive experiments are carried out on both our TextSeg dataset and other existing datasets. We demonstrate that TexRNet consistently improves text segmentation performance by nearly 2% compared to other state-of-the-art segmentation methods. Our dataset and code can be found at https://github.com/SHI-Labs/Rethinking-Text-Segmentation.",
  "s2id": "1af5001d6274fdc61e5fbd852312bd141dda7f3b",
  "twitter": {
    "retweets": 2,
    "likes": 19,
    "replies": 0
  },
  "citations": 2,
  "posterSession": "Thursday"
}