{
  "arXiv": "http://arxiv.org/abs/2011.09670",
  "title": "Dense Label Encoding for Boundary Discontinuity Free Rotation Detection",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Yang_Dense_Label_Encoding_for_Boundary_Discontinuity_Free_Rotation_Detection_CVPR_2021_paper.pdf",
  "authors": [
    "Xue Yang",
    "Liping Hou",
    "Yue Zhou",
    "Wentao Wang",
    "Junchi Yan"
  ],
  "abstract": "Rotation detection serves as a fundamental building block in many visual applications involving aerial image, scene text, and face etc. Differing from the dominant regression-based approaches for orientation estimation, this paper explores a relatively less-studied methodology based on classification. The hope is to inherently dismiss the boundary discontinuity issue as encountered by the regression-based detectors. We propose new techniques to push its frontier in two aspects: i) new encoding mechanism: the design of two Densely Coded Labels (DCL) for angle classification, to replace the Sparsely Coded Label (SCL) in existing classification-based detectors, leading to three times training speed increase as empirically observed across benchmarks, further with notable improvement in detection accuracy; ii) loss re-weighting: we propose Angle Distance and Aspect Ratio Sensitive Weighting (ADARSW), which improves the detection accuracy especially for square-like objects, by making DCL-based detectors sensitive to angular distance and object's aspect ratio. Extensive experiments and visual analysis on large-scale public datasets for aerial images i.e. DOTA, UCAS-AOD, HRSC2016, as well as scene text dataset ICDAR2015 and MLT, show the effectiveness of our approach. The source code will be made public available.",
  "s2id": "f75afea3f0e7e8e2bac07701e012adb111d3e667",
  "twitter": {
    "retweets": 0,
    "likes": 4,
    "replies": 0,
    "ids": [
      "1330016711358091264",
      "1330566829648048133",
      "1330370677715689472",
      "1330174330651766787",
      "1330073082854318085",
      "1329978167889719296",
      "1329796878599385092",
      "1329615576893943809"
    ]
  },
  "citations": 7,
  "posterSession": "Friday"
}