{
  "arXiv": "http://arxiv.org/abs/2004.08697",
  "title": "CausalVAE: Disentangled Representation Learning via Neural Structural Causal Models",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Yang_CausalVAE_Disentangled_Representation_Learning_via_Neural_Structural_Causal_Models_CVPR_2021_paper.pdf",
  "authors": [
    "Mengyue Yang",
    "Furui Liu",
    "Zhitang Chen",
    "Xinwei Shen",
    "Jianye Hao",
    "Jun Wang"
  ],
  "abstract": "Learning disentanglement aims at finding a low dimensional representation which consists of multiple explanatory and generative factors of the observational data. The framework of variational autoencoder (VAE) is commonly used to disentangle independent factors from observations. However, in real scenarios, factors with semantics are not necessarily independent. Instead, there might be an underlying causal structure which renders these factors dependent. We thus propose a new VAE based framework named CausalVAE, which includes a Causal Layer to transform independent exogenous factors into causal endogenous ones that correspond to causally related concepts in data. We further analyze the model identifiabitily, showing that the proposed model learned from observations recovers the true one up to a certain degree. Experiments are conducted on various datasets, including synthetic and real word benchmark CelebA. Results show that the causal representations learned by CausalVAE are semantically interpretable, and their causal relationship as a Directed Acyclic Graph (DAG) is identified with good accuracy. Furthermore, we demonstrate that the proposed CausalVAE model is able to generate counterfactual data through \"do-operation\" to the causal factors.",
  "s2id": "60da51ec04259eafe6866c34304d4ad61385ffd8",
  "twitter": {
    "retweets": 9,
    "likes": 41,
    "replies": 2,
    "ids": [
      "1252493153841676291",
      "1254066313464631301",
      "1252541130157195264",
      "1252414487145013248",
      "1252553660531462145",
      "1252494396592992258",
      "1252439057675677701",
      "1374619444387909634"
    ]
  },
  "citations": 8,
  "posterSession": "Wednesday"
}