{
  "arXiv": "http://arxiv.org/abs/2002.05712",
  "title": "Cross-Iteration Batch Normalization",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Yao_Cross-Iteration_Batch_Normalization_CVPR_2021_paper.pdf",
  "authors": [
    "Zhuliang Yao",
    "Yue Cao",
    "Shuxin Zheng",
    "Gao Huang",
    "Stephen Lin"
  ],
  "abstract": "A well-known issue of Batch Normalization is its significantly reduced effectiveness in the case of small mini-batch sizes. When a mini-batch contains few examples, the statistics upon which the normalization is defined cannot be reliably estimated from it during a training iteration. To address this problem, we present Cross-Iteration Batch Normalization (CBN), in which examples from multiple recent iterations are jointly utilized to enhance estimation quality. A challenge of computing statistics over multiple iterations is that the network activations from different iterations are not comparable to each other due to changes in network weights. We thus compensate for the network weight changes via a proposed technique based on Taylor polynomials, so that the statistics can be accurately estimated and batch normalization can be effectively applied. On object detection and image classification with small mini-batch sizes, CBN is found to outperform the original batch normalization and a direct calculation of statistics over previous iterations without the proposed compensation technique.",
  "s2id": "",
  "twitter": {
    "retweets": 2,
    "likes": 8,
    "replies": 1,
    "ids": [
      "1229294518010351616",
      "1375638924631085056",
      "1232132362898747395",
      "1228902081794277376",
      "1229098254236778502",
      "1228146958574944257",
      "1229430417532620800",
      "1228395812356599809",
      "1228148731607834624",
      "1228150559925915650",
      "1228162148473298944",
      "1228172425684119553",
      "1228251763456671744",
      "1228311691538001920",
      "1228328244128210946",
      "1228342818055155718",
      "1228442310255374336",
      "1229360200240500737",
      "1228524624796954625",
      "1228720762988777472",
      "1375442715987566598",
      "1375344256013983744",
      "1228997684868063234",
      "1267898049495433222",
      "1229231614766403585",
      "1237755407898009600",
      "1228769026228269058"
    ]
  },
  "posterSession": "Thursday"
}