{
  "arXiv": "http://arxiv.org/abs/2007.08488",
  "title": "Complete & Label: A Domain Adaptation Approach to Semantic Segmentation of LiDAR Point Clouds",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Yi_Complete__Label_A_Domain_Adaptation_Approach_to_Semantic_Segmentation_CVPR_2021_paper.pdf",
  "authors": [
    "Li Yi",
    "Boqing Gong",
    "Thomas Funkhouser"
  ],
  "abstract": "We study an unsupervised domain adaptation problem for the semantic labeling of 3D point clouds, with a particular focus on domain discrepancies induced by different LiDAR sensors. Based on the observation that sparse 3D point clouds are sampled from 3D surfaces, we take a Complete and Label approach to recover the underlying surfaces before passing them to a segmentation network. Specifically, we design a Sparse Voxel Completion Network (SVCN) to complete the 3D surfaces of a sparse point cloud. Unlike semantic labels, to obtain training pairs for SVCN requires no manual labeling. We also introduce local adversarial learning to model the surface prior. The recovered 3D surfaces serve as a canonical domain, from which semantic labels can transfer across different LiDAR sensors. Experiments and ablation studies with our new benchmark for cross-domain semantic labeling of LiDAR data show that the proposed approach provides 6.3-37.6% better performance than previous domain adaptation methods.",
  "s2id": "a1267ad88ec0f72e554673edeca750e0825f7d14",
  "twitter": {
    "retweets": 3,
    "likes": 19,
    "replies": 3,
    "ids": [
      "1377755281443053572",
      "1284226669688098817",
      "1283939724093161473",
      "1284800501918445568",
      "1283953793894191105",
      "1283955496031068162",
      "1283959811428712450",
      "1284045301288964097",
      "1284088358831034369",
      "1377755407196782594",
      "1284422977740775425",
      "1284996666186244097",
      "1377435874841948163",
      "1377450874235150341",
      "1377452895109402624",
      "1377632259411435537",
      "1284619308140843014"
    ]
  },
  "citations": 8,
  "posterSession": "Thursday"
}