{
  "arXiv": "http://arxiv.org/abs/2006.11275",
  "title": "Center-Based 3D Object Detection and Tracking",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Yin_Center-Based_3D_Object_Detection_and_Tracking_CVPR_2021_paper.pdf",
  "authors": [
    "Tianwei Yin",
    "Xingyi Zhou",
    "Philipp Krahenbuhl"
  ],
  "abstract": "Three-dimensional objects are commonly represented as 3D boxes in a point-cloud. This representation mimics the well-studied image-based 2D bounding-box detection but comes with additional challenges. Objects in a 3D world do not follow any particular orientation, and box-based detectors have difficulties enumerating all orientations or fitting an axis-aligned bounding box to rotated objects. In this paper, we instead propose to represent, detect, and track 3D objects as points. Our framework, CenterPoint, first detects centers of objects using a keypoint detector and regresses to other attributes, including 3D size, 3D orientation, and velocity. In a second stage, it refines these estimates using additional point features on the object. In CenterPoint, 3D object tracking simplifies to greedy closest-point matching. The resulting detection and tracking algorithm is simple, efficient, and effective. On the nuScenes and Waymo datasets, CenterPoint surpasses prior methods by a large margin. On the Waymo Open Dataset, CenterPoint improves previous state-of-the-art by 10-20% while running at 13FPS. The code and pretrained models are available at https://github.com/tianweiy/CenterPoint.",
  "s2id": "7cd0e23880cbcedbf3a46790674e5e67c1301847",
  "twitter": {
    "retweets": 2,
    "likes": 22,
    "replies": 0,
    "ids": [
      "1274880046591860736",
      "1274877784238641153",
      "1275076376056348673",
      "1275091337940008960",
      "1387346866539483137",
      "1276818189846970368",
      "1276455857665040384",
      "1276093546303455237",
      "1275731047108444163",
      "1275368586916347904",
      "1275197194409213952",
      "1274893386445709318",
      "1274880600608931840"
    ]
  },
  "citations": 19,
  "posterSession": "Thursday"
}