{
  "arXiv": "http://arxiv.org/abs/2008.06910",
  "title": "Neural Descent for Visual 3D Human Pose and Shape",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Zanfir_Neural_Descent_for_Visual_3D_Human_Pose_and_Shape_CVPR_2021_paper.pdf",
  "authors": [
    "Andrei Zanfir",
    "Eduard Gabriel Bazavan",
    "Mihai Zanfir",
    "William T. Freeman",
    "Rahul Sukthankar",
    "Cristian Sminchisescu"
  ],
  "abstract": "We present deep neural network methodology to reconstruct the 3d pose and shape of people, including hand gestures and facial expression, given an input RGB image. We rely on a recently introduced, expressive full body statistical 3d human model, GHUM, trained end-to-end, and learn to reconstruct its pose and shape state in a self-supervised regime. Central to our methodology, is a learning to learn and optimize approach, referred to as HUman Neural Descent (HUND), which avoids both second-order differentiation when training the model parameters, and expensive state gradient descen tin order to accurately minimize a semantic differentiable rendering loss at test time. Instead, we rely on novel recurrent stages to update the pose and shape parameters such that not only losses are minimized effectively, but the process is meta-regularized in order to ensure end-progress. HUND's symmetry between training and testing makes it the first 3d human sensing architecture to natively support different operating regimes including self-supervised ones. In diverse tests, we show that HUND achieves very competitive results in datasets like H3.6M and 3DPW, as well as good quality 3d reconstructions for complex imagery collected in-the-wild.",
  "s2id": "3206e6906d367ccb11d81b7023cdcbb49b480f29",
  "twitter": {
    "retweets": 2,
    "likes": 6,
    "replies": 1,
    "ids": [
      "1295859256004972545",
      "1295717445508960256",
      "1296634505898463232",
      "1295550883317469185",
      "1295536088023470080"
    ]
  },
  "citations": 4,
  "posterSession": "Thursday"
}