{
  "arXiv": "http://arxiv.org/abs/2104.05888",
  "title": "Simpler Certified Radius Maximization by Propagating Covariances",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Zhen_Simpler_Certified_Radius_Maximization_by_Propagating_Covariances_CVPR_2021_paper.pdf",
  "authors": [
    "Xingjian Zhen",
    "Rudrasis Chakraborty",
    "Vikas Singh"
  ],
  "abstract": "One strategy for adversarially training a robust model is to maximize its certified radius -- the neighborhood around a given training sample for which the model's prediction remains unchanged. The scheme typically involves analyzing a \"smoothed\" classifier where one estimates the prediction corresponding to Gaussian samples in the neighborhood of each sample in the mini-batch, accomplished in practice by Monte Carlo sampling. In this paper, we investigate the hypothesis that this sampling bottleneck can potentially be mitigated by identifying ways to directly propagate the covariance matrix of the smoothed distribution through the network. To this end, we find that other than certain adjustments to the network, propagating the covariances must also be accompanied by additional accounting that keeps track of how the distributional moments transform and interact at each stage in the network. We show how satisfying these criteria yields an algorithm for maximizing the certified radius on datasets including Cifar-10, ImageNet, and Places365 while offering runtime savings on networks with moderate depth, with a small compromise in overall accuracy. We describe the details of the key modifications that enable practical use. Via various experiments, we evaluate when our simplifications are sensible, and what the key benefits and limitations are.",
  "s2id": "f7fcd5e177190ceea5531613fcd041981631e067",
  "twitter": {
    "retweets": 2,
    "likes": 1,
    "replies": 0,
    "ids": [
      "1382300393699479552",
      "1382148558305034243",
      "1379139526103330818",
      "1379139525809733635"
    ]
  },
  "citations": 0,
  "posterSession": "Wednesday"
}