{
  "arXiv": "http://arxiv.org/abs/2103.12366",
  "title": "Group-aware Label Transfer for Domain Adaptive Person Re-identification",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Zheng_Group-aware_Label_Transfer_for_Domain_Adaptive_Person_Re-identification_CVPR_2021_paper.pdf",
  "authors": [
    "Kecheng Zheng",
    "Wu Liu",
    "Lingxiao He",
    "Tao Mei",
    "Jiebo Luo",
    "Zheng-Jun Zha"
  ],
  "abstract": "Unsupervised Domain Adaptive (UDA) person re-identification (ReID) aims at adapting the model trained on a labeled source-domain dataset to a target-domain dataset without any further annotations. Most successful UDA-ReID approaches combine clustering-based pseudo-label prediction with representation learning and perform the two steps in an alternating fashion. However, offline interaction between these two steps may allow noisy pseudo labels to substantially hinder the capability of the model. In this paper, we propose a Group-aware Label Transfer (GLT) algorithm, which enables the online interaction and mutual promotion of pseudo-label prediction and representation learning. Specifically, a label transfer algorithm simultaneously uses pseudo labels to train the data while refining the pseudo labels as an online clustering algorithm. It treats the online label refinery problem as an optimal transport problem, which explores the minimum cost for assigning M samples to N pseudo labels. More importantly, we introduce a group-aware strategy to assign implicit attribute group IDs to samples. The combination of the online label refining algorithm and the group-aware strategy can better correct the noisy pseudo label in an online fashion and narrow down the search space of the target identity. The effectiveness of the proposed GLT is demonstrated by the experimental results (Rank-1 accuracy) for Market1501\\toDukeMTMC (82.0%) and DukeMTMC\\toMarket1501 (92.2%), remarkably closing the gap between unsupervised and supervised performance on person re-identification.",
  "s2id": "68a820f738046c41b075f4aa2e47663a465c648b",
  "citations": 1
}