{
  "arXiv": "http://arxiv.org/abs/2012.06044",
  "title": "Mesoscopic Photogrammetry With an Unstabilized Phone Camera",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Zhou_Mesoscopic_Photogrammetry_With_an_Unstabilized_Phone_Camera_CVPR_2021_paper.pdf",
  "authors": [
    "Kevin C. Zhou",
    "Colin Cooke",
    "Jaehee Park",
    "Ruobing Qian",
    "Roarke Horstmeyer",
    "Joseph A. Izatt",
    "Sina Farsiu"
  ],
  "abstract": "We present a feature-free photogrammetric technique that enables quantitative 3D mesoscopic (mm-scale height variation) imaging with tens-of-micron accuracy from sequences of images acquired by a smartphone at close range (several cm) under freehand motion without additional hardware. Our end-to-end, pixel-intensity-based approach jointly registers and stitches all the images by estimating a coaligned height map, which acts as a pixel-wise radial deformation field that orthorectifies each camera image to allow plane-plus-parallax registration. The height maps themselves are reparameterized as the output of an untrained encoder-decoder convolutional neural network (CNN) with the raw camera images as the input, which effectively removes many reconstruction artifacts. Our method also jointly estimates both the camera's dynamic 6D pose and its distortion using a nonparametric model, the latter of which is especially important in mesoscopic applications when using cameras not designed for imaging at short working distances, such as smartphone cameras. We also propose strategies for reducing computation time and memory, applicable to other multi-frame registration problems. Finally, we demonstrate our method using sequences of multi-megapixel images captured by an unstabilized smartphone on a variety of samples (e.g., painting brushstrokes, circuit board, seeds).",
  "s2id": "b30f5a670c6b0416577d51a232826146bc2e2444",
  "twitter": {
    "retweets": 6,
    "likes": 50,
    "replies": 1
  },
  "citations": 0,
  "posterSession": "Wednesday"
}