{
  "arXiv": "http://arxiv.org/abs/2011.10033",
  "title": "Cylindrical and Asymmetrical 3D Convolution Networks for LiDAR Segmentation",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Zhu_Cylindrical_and_Asymmetrical_3D_Convolution_Networks_for_LiDAR_Segmentation_CVPR_2021_paper.pdf",
  "authors": [
    "Xinge Zhu",
    "Hui Zhou",
    "Tai Wang",
    "Fangzhou Hong",
    "Yuexin Ma",
    "Wei Li",
    "Hongsheng Li",
    "Dahua Lin"
  ],
  "abstract": "State-of-the-art methods for large-scale driving-scene LiDAR segmentation often project the point clouds to 2D space and then process them via 2D convolution. Although this corporation shows the competitiveness in the point cloud, it inevitably alters and abandons the 3D topology and geometric relations. A natural remedy is to utilize the 3D voxelization and 3D convolution network. However, we found that in the outdoor point cloud, the improvement obtained in this way is quite limited. An important reason is the property of the outdoor point cloud, namely sparsity and varying density. Motivated by this investigation, we propose a new framework for the outdoor LiDAR segmentation, where cylindrical partition and asymmetrical 3D convolution networks are designed to explore the 3D geometric pattern while maintaining these inherent properties. Moreover, a point-wise refinement module is introduced to alleviate the interference of lossy voxel-based label encoding. We evaluate the proposed model on two large-scale datasets , i.e., SemanticKITTI and nuScenes. Our method achieves the 1st place in the leaderboard of SemanticKITTI and outperforms existing methods on nuScenes with a noticeable margin. Furthermore, the proposed 3D framework also generalizes well to LiDAR panoptic segmentation and LiDAR 3D detection.",
  "s2id": "bf872d5e3fcf46f44a1b9dd76ee0db9a8cc98e06",
  "twitter": {
    "retweets": 0,
    "likes": 2,
    "replies": 1,
    "ids": [
      "1334042536793366530"
    ]
  },
  "citations": 5,
  "posterSession": "Wednesday"
}