{
  "arXiv": "http://arxiv.org/abs/2011.08114",
  "title": "Stylized Neural Painting",
  "pdf": "https://openaccess.thecvf.com/content/CVPR2021/papers/Zou_Stylized_Neural_Painting_CVPR_2021_paper.pdf",
  "authors": [
    "Zhengxia Zou",
    "Tianyang Shi",
    "Shuang Qiu",
    "Yi Yuan",
    "Zhenwei Shi"
  ],
  "abstract": "This paper proposes an image-to-painting translation method that generates vivid and realistic painting artworks with controllable styles. Different from previous image-to-image translation methods that formulate the translation as pixel-wise prediction, we deal with such an artistic creation process in a vectorized environment and produce a sequence of physically meaningful stroke parameters that can be further used for rendering. Since a typical vector render is not differentiable, we design a novel neural renderer which imitates the behavior of the vector renderer and then frame the stroke prediction as a parameter searching process that maximizes the similarity between the input and the rendering output. We explored the zero-gradient problem on parameter searching and propose to solve this problem from an optimal transportation perspective. We also show that previous neural renderers have a parameter coupling problem and we re-design the rendering network with a rasterization network and a shading network that better handles the disentanglement of shape and color. Experiments show that the paintings generated by our method have a high degree of fidelity in both global appearance and local textures. Our method can be also jointly optimized with neural style transfer that further transfers visual style from other images. Our code and animated results are available at https://jiupinjia.github.io/neuralpainter/.",
  "s2id": "552a91e5207ed4c5e6bf998b1f86d631d2a02de2",
  "twitter": {
    "retweets": 89,
    "likes": 545,
    "replies": 8,
    "ids": [
      "1328538066970173442",
      "1343267703394627587",
      "1328749303792361472",
      "1379056978857582592",
      "1333719994572521472",
      "1328855078648868870",
      "1355153450053427200",
      "1333076294355980289",
      "1346139519129673731",
      "1333338365995978754",
      "1340028409997635585",
      "1384179984252555272",
      "1329672754644152323",
      "1367094428335099909",
      "1334843859273199616",
      "1329939053760884736",
      "1330679178748825605",
      "1390509248803602432",
      "1333080332015456258",
      "1353447485553995778",
      "1331906431293878274",
      "1333078241201049608",
      "1379094049286615041",
      "1333078499893018626",
      "1329866546987069442",
      "1333304763799236608",
      "1333080122488991746",
      "1333087446016413702",
      "1333110252200398851",
      "1369567543573221377",
      "1333505064120381440",
      "1333810590565814273",
      "1335002870131818496",
      "1335063889898217472",
      "1379094984926855178",
      "1367274959228215296",
      "1390871621280296963"
    ]
  },
  "citations": 1,
  "posterSession": "Friday"
}